{"ID": ["property_24"], "UUID": ["f3d2bac3-75f6-4130-9a71-400ae35b33dc"], "Image": ["https://www.rightmove.co.uk/properties/127992602#/floorplan?activePlan=1&channel=RES_NEW"], "Price": ["£1,750,000"], "Address": ["Almoners Avenue, Cambridge"], "Type": ["Detached"], "Bedrooms": ["×4"], "Description": ["Property description\nFinal property remaining on this exclusive development of just two high-end homes. A rare opportunity to acquire one of a pair of brand-new substantial detached contemporary properties situated in this most sought-after location just off Hills Road and close to Addenbrookes Hospital and Biomedical Campus. These high specification homes are being built to exacting standards offering contemporary living for the most discerning of buyers. Each property enjoys a tucked away setting with landscaped gardens. Call now to arrange an early viewing. Completion anticipated towards the end of 2022.\n\nThis rarely available and individual development of just two high-end contemporary detached homes is nestled in an established setting at the end of the highly sought after Almoners Avenue on a private drive, just off Hills Road. Located on the south side of the City, the properties form part of a popular residential area and are well placed for access to Addenbrooke’s Hospital and Biomedical Campus.\n\nEach home offers exceptional space and flexibility with bright, well-planned accommodation set across two floors, with large glazed doors opening to a generous terrace and secluded garden. Built to exacting standards, with high specification fittings, the homes each boast an impressive central kitchen/dining/family room with luxury fitted kitchen, Quartz work surfaces and Mielie integrated appliances, with feature vaulted ceiling and gallery above.\n\nEach home will also benefit from a double carport with living roof, landscaped enclosed rear gardens and a 10 year warranty.\n\nPlot 2 is the only plot remaining on this exclusive development. Call now to discuss in more detail. Completion anticipated towards the end of 2022.\n\n*Please note that CGI's are for illustrative purposes only. Architects plans shown and any dimensions given may differ from the final as-built properties. Photos shown are of Plot 1 which is a handed property to Plot 2*\n\nKitchen Fittings - oContemporary kitchen\noQuartz work surfaces and matching up stands\noNovy Panorama Induction Hob\noLED Unit and Centre Island Lights\noStainless Steel Blanco sink\noIntegrated Miele appliances Oven, Combi Microwave, Warming Drawer, Fridge, Freezer, Dishwasher\noUnder Counter Wine Cooler\noPre-wired for streamed audio\n\nUtility Room - oContemporary kitchen\noStainless steel Blanco sink\noPlumbing and space for washing machine and separate tumble drier\noHigh efficiency Vaillant Ecotec plus boiler\n\nHeating And Water System - oHigh efficiency Vaillant Ecotec plus boiler\noUnderfloor heating to ground floor with independent zoned thermostat’s\noRadiators to first floor\noHigh capacity 300L pressurised hot water cylinders with electric immersion heater\noOutside tap\n\nBathrooms, En Suites And Cloakrooms - oContemporary white Duravit sanitaryware\noHansgrohe chrome mixer taps and shower fittings\noCrosswater Dual Control Bar shower\noVerde Bath (main bathroom only)\noDuravit Vanity units with wash basin over\noSoft Close toilet seats\noHeated Ambience LED Mirrors\noHeated chrome towel rails\noHeated Floors\noTiled floor and walls\n\nElectrical - oData wiring system\noIntruder alarm\noTelevision points to all reception rooms and bedrooms\noData points to all reception rooms and bedrooms\noPre-wired for Streamed Audio\noLED down lighters throughout\noExternal lights to front, side and rear\noExternal waterproof double power socket\noWired smoke alarms\noElectric car charging point\n\nConstruction And External Finishes - oHigh quality facing brickwork\noSlate tiled roof\noZinc Fascia, Guttering and Downpipes\noHigh specification Aluminium double-glazed windows and doors\noAluminium Bi-fold doors to Living room\noChrome/Glass Juliette Balconies\noBrick double garage with Sedum Roof and Electric charging points\n\nInternal Finishes - oContemporary style internal doors\noVenti Lever Satin Nickel Ironmongery\noBespoke Oak/Glass staircase\noDividing doors to Living room\no100L log burning stove to Living Room room\n\nFlooring - oFitted floor throughout\noTiled floors to bath and shower rooms\n\nProperty Details - oWarranty: 10 year One Guarantee warranty\noTenure: Freehold\noServices: All mains services are connected to the property.\noLocal Authority\noSouth Cambridgeshire District Council.\noUnless specifically mentioned in these particulars all fixtures and fittings are expressly excluded from the sale of the freehold interest.\n\nServices - All mains services connected\n\nStatutory Authorities - Cambridge City Council\n\nFixtures And Fittings - Unless specifically mentioned in these particulars all fixtures and fittings are expressly excluded from the sale of the freehold interest.\n\nViewing - Strictly by appointment through the vendor’s sole agents, Redmayne Arnold and Harris\n\nBrochures\nAlmoners Avenue, Cambridge\nBrochure\nShow less"]}