[
    {
        "ID": "property_1",
        "UUID": "8a31c191-9996-42f8-a026-0b6a93633155",
        "Image": "https://media.rightmove.co.uk/106k/105848/128269403/105848_100539081819_IMG_00_0000.jpeg",
        "Price": "£6,500,000",
        "Address": "Chrishall Grange Farm, Heydon, Royston",
        "Type": "Farm Land",
        "Description": "Property description\nIntroduction\nThe sale of Chrishall Grange Farm provides an excellent opportunity to acquire an agricultural investment in an attractive location on the South Cambridgeshire/North West Essex border. The holding is let on a long-term Farm Business Tenancy and is farmed as a mixed arable and livestock enterprise with a good range of modern farm buildings, secondary range of timber framed traditional buildings, mature woodland and two cottages.\n\nThe holding is managed and maintained to an excellent standard, with the tenant combining a particular focus on environmental schemes with mixed use commercial farming enterprises.\n\nThe holding is situated in an accessible location just south of the A505 Duxford-Royston road and lies approximately 6 miles northeast of the market town of Royston and 11 miles south of the university city of Cambridge.\n\nMethod of Sale\nFor sale by private treaty as a whole subject to the existing Farm Business Tenancies.\n\nGrange Farmhouse (see details below) is outside of the Farm Business Tenancy but subject to a third party tenancy and may be available by separate negotiation.\n\nDescription\n\nChrishall Grange Farm extends in total to 1042.74 acres (or thereabouts) of arable, pasture and woodland together with a good range of modern farm buildings and two Victorian cottages.\n\nThe Land\n\nThe land is classified as predominantly Grade 2 with some Grade 3, and is of mixed soil types ranging from light sandy loam soils in the west to chalky loam in the south. The land is free draining and is generally level with some steeper land to the south-west and is divided into good sized field parcels with excellent access provided off local roads and internal farm tracks.\n\nThe wooded areas include a number of mixed species shelterbelts together with Chrishall Grange Plantation (42.50 acres) which is a mature mixed species woodland.\n\nThe Buildings\n\nThe principal range of farm buildings is accessed off a concrete farm drive which leads to a concreted yard area and buildings comprising:\n\nMain Grain Store (100´ x 80´) portal steel frame with roller shutter doors, grain walling and drying floor with galvanised central fan tunnel. Approximate capacity 1200 tonnes.\n\nWorkshop (40´ x 80´) portal steel frame with two pairs of sliding doors and concrete floor.\n\nSecond Grain Store (80´ x 60´) portal steel frame with roller shutter doors, grain walling and drying floor with central fun tunnel. Approximate capacity 800 tonnes.\n\nGeneral Purpose Lean-to (30´ x 80´) portal steel frame, open sided with hardcore floor\n\nMachinery Store (30´ x 100´) portal steel frame with profile sheet roof and side cladding, open fronted with hardcore floor.\n\nThere are a number of additional buildings which are off-lying from the main farmyard and include:\n\nCamps Barn (100´ x 45´) portal steel frame with grain walling, asbestos sheet roof and side cladding, roller shutter door and concrete floor.\n\nNoshire Barn (100´ x 45´) portal steel frame with grain walling, asbestos sheet roof and side cladding, roller shutter door and concrete floor.\nRedlands Buildings comprise a range of timber framed weatherboard barns with corrugated iron roof coverings including Main Barn (60´ x 20´) plus open fronted lean-to (60´ x 15´) and Cart Lodge (45´ x 15´).\nDebdens Field Barn (30´ x 20´) concrete block, asbestos sheet roof and earth floor.\nThe site of a former World War 2 camp is located on part of the Chrishall Grange Plantation with a number of redundant camp buildings.\n\nThe Cottages\n\nNo 1 Chrishall Grange Cottages - a Victorian semi-detached brick and slate cottage with Entrance Hall, Sitting Room, Kitchen/Dining Room, Utility Room, Cloakroom/WC and Boot Room. First Floor - landing with airing cupboard, 3 Bedrooms and Bathroom. Outside - off-road parking, timber workshop building, coal shed, brick garden store and gardens to the rear and side. Oil-fired central heating and septic tank drainage.\n\nNo 3 Chrishall Grange Cottages - an end-terrace Victorian cottage of brick and slate construction with part rendered elevations with Entrance Porch, Living Room, Dining Room, Kitchen, Cloakroom/WC, Study, Utility/Boot Room. First Floor - landing leading to 2 Bedrooms and Bathroom. Outside - gravelled driveway providing off-street parking, timber garage/store and rear garden. Oil-fired central heating and septic tank drainage.\n\nAgents Note: The Grange Farmhouse is located off the main farm drive and may be available by separate negotiation. The property comprises a 4-bed single storey property built in the mid 1970´s with double garage and gardens and is subject to an Agricultural Occupancy Condition. Please refer to agents for further information.\n\nTenure and Possession\n\nThe property is offered for sale freehold subject to three long-term Farm Business Tenancies dated 11th November 2002. The principal tenancy terms are as follows:\n\nTerm - initial term of 35 years for the period 28th December 2000 to 30th September 2036 with succession rights.\n\nRent Review - the rent payable is determined in accordance with Schedule 2 of the Agricultural Holdings Act 1986 with fixed review dates on each third anniversary. The next rent review is due 30th September 2023.\n\nCurrent Rent - the principal passing rent is £68,000 pa plus and additional £10,275 pa from Landlord approved subletting (see below). Total rent - £78,275 pa.\n\nSubletting - the Landlord has approved the subletting of approximately 103 acres of land on a pig licence, and No 3 Chrishall Grange to Rattlerow Farms Ltd for the period 1st September 2021 to 1st September 2023.\n\nRepairs and Insurance - the tenant is responsible for all repairs maintenance and insurance.\n\nAlienation - the tenant may not assign, sublet, part with possession or share occupation of the holding without Landlords written consent.\n\nPart Resumption - the Landlord is entitled to recover possession of up to 1/10th of the holding for non-agricultural use for which planning permission has been granted.\n\nServices\n\nPrivate Borehole - a private borehole supplies the main farm buildings, field troughs and 1 and 3 Chrishall Grange Cottages together with 17 other residential properties in Chrishall Grange which are in third party ownership. The system was substantially upgraded in 2021 with the installation of a UV sterilisation plant, tri-booster pumps, new alkathene pipe and associated fittings. The supply is regulated under the Private Water Supplies Regulations 2018 (Amended) with the most recent Risk Assessment completed on 22nd June 2022.\n\nThe third-party property owners pay an annual rate for the supply of water to their properties.\n\nA further borehole is located adjacent to Redlands buildings which is used solely for test sampling.\n\n3-phase electricity is connected to the main farm buildings.\n\nDevelopment Overage\nThe land will be sold subject to a Development Overage in the event that planning permission is granted for any development other than for agricultural or equestrian purposes.\nThe uplift will be for 30% of any net development value resulting from the grant of planning permission, change of use or similar consent within a period of 40 years from completion of the sale. The overage will be triggered on commencement of the development or on the sale of the land with planning permission whichever is sooner.\n\nDrainage Rates\nStandard Environment Agency drainage rates are currently payable by the tenant.\n\nVAT\nThe land is not registered for VAT however If the sale of the property or any right attached to it is deemed a chargeable supply for the purpose of VAT, such tax shall be payable by the purchaser in addition to the sale price.\n\nTown and Country Planning\nThe majority of the holding is situated within South Cambridgeshire District Council with Redlands buildings and the surrounding land located in Uttlesford District Council.\n\nThe property is sold subject to any development plans, tree preservation orders, town planning schedules, applications, permissions and resolutions which may be or come into force. The purchaser(s) will be deemed to have full knowledge and have satisfied themselves as to the provisions of any such matters affecting the property.\n\nBasic Payment Scheme\nThe Basic Payment Scheme entitlements are registered and owned by the current tenant.\n\nEnvironmental and Grant Schemes\nThe tenant entered the holding into a 10-year Higher Level Stewardship scheme in 2013, and has also restocked existing and created new woodland areas under various Woodland Grant Schemes since the tenancy commenced.\n\nSporting, Timber and Minerals\nAll sporting, timber and mineral rights are included in the sale insofar as they are owned. The timber and mineral rights are reserved to the Landlord. The sporting rights are let to the tenant under the Farm Business Tenancy.\n\nWayleaves, Easements, Covenants and Rights of Way\nThe land is sold subject to and with the benefit of all existing wayleaves, easements, covenants and rights of way whether or not disclosed.\n\nThe sellers will retain a right of way for all purposes and at all times across a section of the main farm drive leading to Grange Farmhouse, together with rights for all services including the septic tank located on Chrishall Grange Farm land.\n\nThere are two high pressure gas pipes crossing the land.\n\nTwo public bridleways pass through the southern part of the holding, one of which is part of the Icknield Way.\n\nTenant Right and Dilapidations\nThere will be no ingoing valuation or adjustment for tenant´s fixtures or improvements and the purchaser shall not claim for dilapidations, if any, in relation to the property.\n\nExchange and Completion\nExchange of contracts shall be within 6 weeks of the purchaser´s solicitor receiving a draft contract. Completion date to be agreed between the parties.\n\nThe rent due with effect from 30th September 2022 will be apportioned according to the date of completion. The water supply payments received by the seller from third parties will be apportioned from 1st April 2022 to the date of completion.\n\nBoundaries\nThe vendor and vendor´s agents will do their best to specify the ownership of boundary hedges, fences and ditches but will not be bound to determine these. The property is available for inspection and the purchaser(s) will be deemed to have satisfied themselves as to the ownership and location of the boundaries.\n\nPlans, Areas and Schedules\nPlans attached to the particulars are based upon the Ordnance Survey and are for identification purposes only.\n\nLocal Authorities\nSouth Cambs District Council, South Cambridgeshire Hall, Cambourne Business Park, CB23 6EA\n\nUttlesford District Council, Council Offices, London Road, Saffron Walden, Essex, CB11 4ER\n\nViewings and Further Information\nAll viewings are strictly by prior by appointment with the sole selling Agents. For further information please contact Simon Gooderham on Option 2.\n\nAs always, potential hazards exist on working farms and it is requested that all viewings are undertaken with care and regard to safety particularly with regard to any areas in and around buildings. If there are any matters of particular importance or relevance then please discuss these with the agent prior to viewing in order to avoid any wasted journeys.\n\nAnti-Money Laundering Regulations\nBuyers will be required to provide proof of identity and address to the Selling Agent following acceptance of an offer (subject to contract) and prior to Solicitors being instructed.\n\nSellers Solicitors\nBirketts LLP, 22 Station Road, Cambridge, CB1 2JD | +44 (0)\nref Rachel Mc Killop-Wilkin Rachel-McKillop-\n\nAgents Notes\nFor clarification we wish to inform purchaser(s) that we have prepared these sales particulars as a general guide. None of the statements contained in these particulars as to the property shall be relied on as statements of fact. All measurements are given as a guide and no liability can be accepted for errors arising therefrom. The plan and acreages use gross acreages taken from the Ordnance Survey sheets and are for identification purposes only. The purchaser(s) shall be deemed to have full knowledge of the state and condition thereof and as to the ownership or any tree boundary or any part of the property. If communications, condition of the property, situation or such factors are of a particular importance to you please discuss these priorities with us before arranging an appointment to view to avoid a potentially wasted journey. October 2022\nBrochures\nPDF brochure\nEnergy Performance Certificates\nEPC Front Page\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_2",
        "UUID": "f39dabfa-a164-499c-8ee8-c7dd2a54571f",
        "Image": "https://media.rightmove.co.uk/35k/34529/126708074/34529_CAM210328_IMG_00_0000.jpeg",
        "Price": "£6,500,000",
        "Address": "Adams Road, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nA magnificent Victorian house with beautifully presented accommodation, set in stunning landscaped gardens, in an idyllic west city location.\n\nCambridge City Centre 1 mile, Mainline Railway Station 2 miles (Liverpool Street 70 minutes and King's Cross 49 minutes), M11 (Junction 13) 2.5 miles (distances and times are approximate).\n\nDating from 1899, No 7 Adams Road is a truly wonderful example of the late Victorian era and most imposing from its rear elevation, with charming reception rooms, original features still intact and a delightful aspect over the gardens to the south. Constructed of mellow red brick elevations with pretty tile hanging to the first floor under a tiled roof, of particular note is the superb first floor Library with its barrelled ceiling.\nMore recently the current owners have sympathetically extended and renovated the property under the direction of NRAP, a leading Cambridge practice to ensure the retention of many of the original period features including panelling, window seats and cornicing. Merging seamlessly with the original building, the new extension incorporates a large family kitchen/breakfast room with handmade units by Chalon of London, a splendid conservatory built by Vale Garden Houses leading through to the spa/gym with bespoke glass shower and sauna enclosures and an Italian spa designed by Tecu with Luna stone tiling. A new luxurious principal bedroom occupies the entirety of the first floor of the extension and completes this work.\n\n\nAdams Road is widely regarded as one of the best addresses in the city and is characterised by substantial houses in large gardens. Situated less than a mile west of the heart of the\nhistoric centre, the property occupies an idyllic position close to many of the College and University Departments and their playing fields, including St John's College School and King's College School which are just a short walk away in neighbouring Grange Road and West Road respectively. Cambridge also offers a wide range of educational and cultural amenities and is not only world renowned for its academic achievements, but also has become an important centre for the ‘high tech’ and ‘bio tech’ industries with the University Research and Development Laboratories and the internationally renowned Cambridge Science Park. Addenbrooke’s Hospital and the new Cambridge Biomedical Campus, planned to be one of the largest centres of health, science and medical research in the world, is within about 1.5 miles to the east. London commuters are well served with a mainline railway station about 2 miles away providing services to King’s Cross and Liverpool Street in about 52 and 67 minutes respectively and the M11 (junction 11) is about 2.5 miles away providing access to Stansted Airport and the M25.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_3",
        "UUID": "96b38bcf-7b96-4670-95ed-c7f1475b315d",
        "Image": "https://media.rightmove.co.uk/37k/36227/125258033/36227_IPR220012_IMG_00_0000.jpeg",
        "Price": "£4,300,000",
        "Address": "Willingham House Stud, Brinkley, Newmarket, Suffolk, CB8",
        "Type": "Equestrian Facility",
        "Description": "Property description\nA SUPERB 100 ACRE STUD FARM WITH AN EXCELLENT FAMILY HOUSE AND FUNCTIONAL STUD BUILDINGS\n\nDescription\n\nIntroduction\nWillingham House Stud is superbly placed to take advantage of Newmarket’s prominent position in the bloodstock world. For many years Willingham has been used for the boarding of broodmares and the preparation of their progeny for the sales. Immaculately presented, the stud is a real centre of excellence which a buyer can further develop due to the recent expansion of the paddock area.\n\nWillingham House\nOriginally built in the 1970’s, Willingham House sits behind a high hedge well set back from Willingham Green Road. In superb condition, the house has been fastidiously maintained. Built of brick under a tiled roof, it is an excellent family house with flexible accommodation with up to 7 bedrooms including the annexe, which is currently incorporated into the main house. High ceilings throughout give the house a light and airy feel. The hall, kitchen and utility have stone floors. The well fitted kitchen has an oil fired Aga and electric hob and oven.\n\nOn the first floor are six bedrooms, 2 two of which have en-suite bathrooms, and 2 family bathrooms. Some of the bedrooms are dual aspect with views over the stud. A large office overlooking the stud could be converted to a seventh bedroom.\n\nThe house has a gravel driveway, with a separate entrance to the rest of the stud. There are excellent gardens surrounding the house, with a terrace accessed from the breakfast room and the side hall.\n\nThe Paddocks\nAround 50 acres have been in paddocks for many years, a further 35 acres were acquired more recently and have been fenced and put down to grass in the last year. The stud now occupies most of the southern side of the village of Brinkley.\n\nThe main block extends to 98 acres in total, with a further 2 acres to the south, on the other side of Willingham Green Road.\n\nThe Land\nFlat and gently sloping, the land has been meticulously maintained to create the perfect environment for the rearing of young horses. Classed as Grade 2 on the Agricultural Land Classification map, the soil is a highly fertile, lime rich loamy and clayey soil.\n\nWith a separate entrance, the stud farm buildings are in three main areas:\n\n1) The Main Yard (22 boxes including 4 foaling boxes)\n\n2) The Sand Yard (12 boxes)\n\n3) The Isolation Yard (8 boxes)\n\nLocation\n\n7 miles from Newmarket, Willingham House Stud is close to Brinkley, a popular village, and is within easy reach of Cambridge 14 miles away. Nearby Burrough Green has a pub, church and primary school. Willingham House Stud is situated on Willingham Green Lane, just south of the village.\n\n\n\n\nAcreage: 100.82 Acres\n\nDirections\n\nFrom London and the M11: Take the A11 and filter left signed A1304 towards Newmarket. After the level crossing at 6 Mile Bottom turn right to Brinkley, and in Brinkley turn right on the B1052 towards Weston Colville. After half a mile turn left into Willingham Green. The entrance is ¼ mile on the left.\n\nFrom Newmarket: Take the Dullingham Road, (B1061), through Dullingham and Burrough Green and Brinkley, then after half a mile turn left onto Willingham Green. The entrance to Willingham House Stud is ¼ mile on the left.\n\nAdditional Info\n\nPart of the property is subject to an overage provision. Further details of which are available from the selling agents.\n\nWe understand part of the property is elected for VAT purposes. For further details please contact the selling agents.\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_4",
        "UUID": "6557da9b-05af-4c85-a136-8de2a2502be8",
        "Image": "https://media.rightmove.co.uk/35k/34529/126712253/34529_CAM220372_IMG_00_0000.jpeg",
        "Price": "£3,250,000",
        "Address": "Caxton Road, Great Gransden, Sandy, Cambridgeshire",
        "Type": "Detached",
        "Description": "Property description\nAn absolutely stunning Georgian period property occupying an idyllic location, set in 7.67 acres, with annexe and versatile outbuildings including a Grade II listed barn.\n\nCambridge 13 miles, Huntingdon 12 miles, St Neots (fast train service to King’s Cross) 7 miles, A1 8 miles, (distances are approximate).\n\nHardwicke Farm is believed to date from 1810 and is a beautiful example of the Georgian period, which is typically renowned for its well-proportioned rooms and high ceilings. Since purchasing the property, the present owners have carried out comprehensive improvements to the property to an exceptionally high standard, with care being taken to retain the period features which include cornicing, ceiling\nroses, deep skirtings, dado rails and marble fireplaces. The versatile accommodation is immaculately presented throughout and extends to an impressive and tremendously\nversatile 7,290 sq ft (678 sq m), to include an independent 2 bedroom Annexe and Outbuildings extending to a further\n4,219 sq ft (392 sq m).\n\nHistorical Note Magnificent Grade II listed Barn dating from circa 1844 with small kitchen and WCs. Constructed with local red brick under a hipped slate roof with 6 bays, 2 high double entry’s with elliptical arches to the south facing elevation and geometric ventilation holes. Two adjacent rows of contemporary stables also of red brick under slate roofs, form the east and west boundaries to a central courtyard.\n\nGreat Gransden is an attractive and popular village situated approximately 13 miles west of Cambridge and 12 miles south-east of Huntingdon. Local facilities include a primary\nschool, post office, public house and general store together with bowls and tennis clubs. Nearby, Cambridge is not only world renowned for its academic achievements, but has also become a ‘high tech’ and ‘bio tech’ hub with the University Research and Development Laboratories, internationally renowned Cambridge Science Park and Addenbrooke’s Hospital/Biomedical Campus one of the largest centres of health, science and medical research in Europe. The city also provides an attractive combination of ancient and modern buildings, colleges, winding lanes, the tree-lined river Cam and extensive shopping facilities, together with an excellent choice of independent schools.\n\nRoad and rail communications are good with the A428 within about 3 miles providing links with the A1 to the west and the M11 to the east and there is a mainline railway station at St Neots with services to London’s King’s Cross in about 40 minutes.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_5",
        "UUID": "96231b0c-4509-4587-adc0-f524b171363b",
        "Image": "https://media.rightmove.co.uk/66k/65243/73664955/65243_TMH78272_IMG_01_0000.jpg",
        "Price": "£3,000,000",
        "Address": "Mines Park, Cambridgeshire",
        "Type": "Land",
        "Description": "Property description\nMines Park offers a rare opportunity to acquire an incredible plot of approximately 100 acres, with planning permission for an outstanding contemporary manor house and staff cottages, designed by Tom Emerson of 6A Architects. It is located just eight miles south-east of Cambridge in a rural, lake-side location surrounded by rolling arable fields and ancient woodland.\n\nThe design proposes a main structure of over 12,000 sq ft, with a further 2,900 sq ft of staff cottages, in a form that echoes and reinterprets the traditional 18th-century timber-framed manor house. Sustainability is at the heart of the project, employing an exposed-oak structure in-filled with hempcrete for a lower carbon footprint.\n\nThe main house is set over four levels and surrounded by a terrace at ground level. Internally, the plan is largely open and therefore highly flexible, with a double-height drawing room at one end, and kitchen, pantry and dining areas at the other.\n\nSeven bedrooms are set over the upper levels, including a double-height master bedroom, all cleverly interspersed with terraces on the first floor and external courtyards on the second.\n\nA swimming pool, spa and gym occupy the lower-ground level, along with staff quarters and underground parking for three cars.\n\nThe two staff cottages, 1,500 sq ft and 1,400 sq ft, will offer a low profile next to a wooded area, capped by the contemporary aesthetic of a concrete roof. They are arranged across a central courtyard and linked by sheltered parking bays.\n\nA natural meadow falls to the lake where there will be an orchard and a walled growing garden containing a greenhouse and a family garden. A new woodland is intended to provide around 50 acres of sustainable fuel for the house and a system has been devised for water re-use. involving reed-bed filtration into a clean-water lake.\n\nMines Park is set in beautiful rural seclusion between Weston Green and West Wratting. The city of Cambridge and its broad selection of shops and restaurants is easily reachable. Cambridge train station is approximately 20 minutes by car, with direct routes to London King?s Cross in a journey time of around 50 minutes.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_6",
        "UUID": "db4f947a-f11b-40ac-9a96-ceca69a8627b",
        "Image": "https://media.rightmove.co.uk/48k/47865/85915575/47865_NCA220305_IMG_00_0000.jpeg",
        "Price": "£3,000,000",
        "Address": "High Street, Hauxton, Cambridge",
        "Type": "Plot",
        "Description": "Property description\nA unique chance to purchase a redevelopment opportunity of a substantial family home, outbuildings, studio and separate detached bungalow set within grounds of 8.08 acres (3.272 hectares) with extensive river frontage.\n\n** Best and final offers are invited by 12 noon on Friday, 11th November 2022. Contact us to register your interest and obtain details of how to submit your offer **\n\nPOTENTIAL DEVELOPMENT OPPORTUNITY\n\nA unique chance to purchase a redevelopment opportunity of a substantial family home, outbuildings, studio and separate detached bungalow set within grounds of 8.08 acres (3.272 hectares) with extensive river frontage.\n\nDESCRIPTION\n\nNo. 23\nGross internal floor area 2,881 sq ft (267.7 sq m)\n\nCollection of outbuildings comprising studio, garage, workshop and stable with the opportunity for redevelopment to a substantial single storey dwelling in the region of 2,140 sq ft (subject to planning).\n\nNo. 25\nGross internal floor area 4,607 sq ft (428 sq m)\n\nPrincipal residence on the site with accommodation comprising:\n• Ground Floor: Reception Hall, Sitting Room, Dining Room, Kitchen, Family Room, Pantry, Work Room, Utility, Boiler Room, Store Room, Garden/Entertainment Room, Home Office, Conservatory\n• First Floor: Principal Bedroom with Balcony, Dressing Room and En Suite Shower Room, 3 Further Bedrooms, Family Bathroom, Study Area\n\nNo. 27\nGross internal floor area 827 sq ft (76.9 sq m)\n\nExisting 2 bedroom bungalow within a large garden offering the opportunity for redevelopment into a substantial single storey dwelling of circa 3,175 sq ft (subject to planning). Current accommodation comprises Kitchen, Living Room, 2 Bedrooms, Bathroom.\n\nPlanning\nThe site is located within the jurisdiction of South Cambridgeshire District Council.\n\nThe vendor has previously submitted a pre-application enquiry for the redevelopment of properties No. 23 and No. 27. Copies of both responses are available to view for interested parties.\n\nThe redevelopment is as proposed:\n\nNo. 23 – 4 bed, 199 sqm (2,140 sq ft)\nNo. 27 – 4 bed, 295 sqm (3175 sq ft)\n\nWayleaves, Easements, Covenants & Right of Way\nThe site will be sold subject to all wayleaves, easements, covenants and rights of way, whether or not disclosed.\n\nValue Added Tax\nWe understand that VAT will not be chargeable on the purchase price, however in the event that VAT does become payable, it will be charged at the prevailing rate.\n\nBoundaries\nThe vendor and vendor’s agents will do their best to specify ownership of all boundaries but will not be bound to determine these. Interested parties will have to satisfy themselves to the ownership of all boundaries.\n\nLocation\nHauxton lies to the south of Cambridge just off the A10 only 1.5 miles from junction 11 of the M11. The village has an historic church, village hall and primary school. Local shopping and public houses are available at Harston (1 mile) and Great Shelford (2 miles). More extensive shopping and schooling facilities are available in the city of Cambridge approximately 4.5 miles away.\n\nThe University city of Cambridge is not only world renowned for its academic achievements but also as an important centre for the \"high-tech\" and research and development industry. The city also provides a wide range of shopping and cultural facilities along with an excellent choice of state and highly rated independent schools for all ages.\n\nFor the commuter, Foxton Railway Station (about 3 miles) provides a service to London's King's Cross 72 minutes), Whittlesford Parkway Station (about 5.5 miles) provides a service to London's Liverpool Street (60 minutes) and Cambridge Railway Station (about 4.9 miles) provides services to both King’s Cross and Liverpool Street in about 52 minutes and 68 minutes respectively.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_7",
        "UUID": "9dcefde1-8a53-41da-825f-6c2eea3b4441",
        "Image": "https://media.rightmove.co.uk/53k/52648/126598163/52648_100424021384_IMG_00_0000.jpeg",
        "Price": "£2,950,000",
        "Address": "Ickleton, Cambridgeshire",
        "Type": "Detached",
        "Description": "Property description\nENTRANCE Into: \n\nGRAND ENTRANCE HALL With quarry tiled flooring, vintage radiators, decorative cornice, staircase to the first floor with storage beneath, door to the rear and doors to: \n\nDRAWING ROOM 30' 6\" x 15' 6\" (9.3m x 4.72m) A stunning reception room with sliding sash window to the front aspect with working window shutters and open fireplace set within a stone hearth, bay window with further sash windows and window seats, decorative alcove and further storage and quarter cut oak flooring. \n\nDINING ROOM 15' 6\" x 15' 0\" (4.72m x 4.57m) Another stunning formal reception room with sliding sash window to the front with working window shutters, open fireplace with decorative hearth, decorative cornicing, oak floor and serving hatch. \n\nSITTING ROOM 15' 7\" x 13' 4\" (4.75m x 4.06m) A further reception room with sash window with working window shutters, fireplace with log burning stove, picture rail and doors opening to the Cellar and Kitchen. \n\nKITCHEN 15' 11\" x 15' 8\" (4.85m x 4.78m) A stylish handmade bespoke kitchen with a range of wall and base units under granite worktop with double butler sink inset. Integrated appliances include electric Aga with dual hotplates, full height fridge, fridge/freezer, larder, dishwasher, plenty of space for breakfast table and chairs and a bay window with oak wooden flooring and sash window with views across the grounds creating an ambient coffee corner. \n\nUTILITY ROOM 13' 5\" x 10' 8\" (4.09m x 3.25m) With an extensive range of storage and further base units under worktop with space and plumbing for a washing machine and tumble drier. Stable door to the rear. \n\nSTUDY 12' 0\" x 11' 1\" (3.66m x 3.38m) With decorative cornicing, wood flooring and sash window.  \n\nCLOAKROOM Fitted with a vintage Thomas Crapper WC and wash basin.  \n\nCELLAR 13' 11\" x 11' 11\" (4.24m x 3.63m) A useful dry cellar that would be ideally utilised for wine storage. \n\nFIRST FLOOR  \n\nLANDING With sash window and oak window shutters on the half landing. A generous landing with staircase to the second floor, decorative moulded cornicings and doors to: \n\nPRINCIPLE SUITE 15' 6\" x 15' 1\" (4.72m x 4.6m) A stunning spacious bedroom with decorative cornicing and alcove, wood flooring and sliding sash window to the front aspect. En-Suite stylishly fitted with a freestanding roll top bath with ball and clawed feet, double tiled shower cubicle, wash basin, WC, heated towel rail and decorative tiled flooring with underfloor heating and sash windows with oak window shutters.  \n\nBEDROOM 2 15' 6\" x 14' 10\" (4.72m x 4.52m) Another generous double bedroom of dual aspect with decorative cornicing, sliding sash window and door to the Dressing Room with a further sash window to the front.  \n\nBEDROOM 3 15' 0\" x 13' 7\" (4.57m x 4.14m) Another double bedroom with decorative cornicing, sliding sash window and wash hand basin.\n\n \n\nBEDROOM 4 13' 7\" x 10' 0\" (4.14m x 3.05m) With wooden flooring, sash window and En-Suite comprising tiled shower cubicle, WC, pedestal sink unit and part tiled walls and flooring. \n\nBATHROOM Accessed via a lobby with a large airing cupboard with window above with steps leading down to a spacious and stylish bathroom comprising freestanding roll top bath with ball and claw feet, double tiled shower cubicle, WC, pedestal sink unit, vintage radiator, tiled flooring with underfloor heating and sliding sash window with oak window shutters. \n\nSECOND FLOOR  \n\nATTIC ROOM 19' 8\" x 18' 8\" (5.99m x 5.69m) A generous attic room that could be utilised as further guest accommodation having shower room located to the other side of the eaves. Alternatively used as a games room or further home office \n\nANNEXE A highly versatile and practical outbuilding formerly the original Coach House currently utilised as a two bedroom Annexe with open plan Kitchen and Sitting Room, accessed via French doors leading to the courtyard with two bedrooms and a shower room located off with a staircase leading to the first floor with an extensive Games Room that could be utilised as further accommodation. The space could also be utilised as a Garden Kitchen for those who enjoy outdoor entertaining.\n \n\nTHE COACH HOUSE Another exceptional outbuilding with parking for a range of vehicles and accessed via four bay barn style doors to the first floor. There is a further range of extensive and practical rooms currently utilised as a Snooker Room, Meeting Room, Gym and Office with adjoining Kitchen and Cloakroom facilities.  \n\nOUTSIDE The property is approached via wrought iron gates leading to the sweeping carriage driveway past stone bollards, linked by chains, lawned areas and a range of mature trees. A five bar gate leads to the gravelled courtyard at the side of the property and access to the Coach House providing extensive off-road parking for multiple vehicles. The extensive grounds are beautifully mature and include mature trees and specimen trees, topiary hedging and a wooded copse to the rear. The property further enjoys an extensive York stone terrace set adjacent a raised Koi Carp Pond with steps leading out to an expanse of traditional lawn, whilst a range of further practical outbuildings include a heritage style Hartley Botanic Greenhouse, Stable, Tack Room and Workshop and a range of further storage sheds.\n\nIn all about 3.06 acres.\n\n \n\nSERVICES: Main water, electricity, main drains, oil-fired heating. NOTE: None of the services have been tested by the agent.\n\nTENURE: Freehold.\n\nLOCAL AUTHORITY: South Cambridgeshire District Council . Council Tax Band: H. £4,077.64 per annum.\n\nEPC RATING: F.\n\nVIEWING: Strictly by appointment through David Burr - .\n Brochures\nBrochure\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_8",
        "UUID": "55358ac3-0c61-466d-901f-827fe5acfcac",
        "Image": "https://media.rightmove.co.uk/37k/36227/121850885/36227_CAS220081_IMG_16_0001.jpeg",
        "Price": "£2,750,000",
        "Address": "Bury Road, Newmarket, Suffolk, CB8",
        "Type": "Detached",
        "Description": "Property description\nImpressive house with spectacular views over Newmarket heath.\n\nDescription\n\nMesnil Warren was originally the home of Champion Racehorse Trainer, The Hon. George Lambton. He trained horses for Lord Derby from the turn of the century until 1933. In 1925, Sir Edwyn Lutyens was commissioned to design a large extension to the house to provide extra guest bedrooms and further staff accommodation, which perfectly compliments the late Victorian original.\n\nThe current owners acquired Mesnil Warren in 2018 and completed significant renovations to the property. The house is being sold with vacant possession and no upward chain.\n\nDESCRIPTION\nMesnil Warren is a substantial house dating from the latter part of the nineteenth century.\n\nSet back from the Bury Road behind a tall wall and with commanding views over Newmarket Heath and the Warren Hill gallops. Constructed of brick under a tiled roof the house has extensive accommodation laid out over three floors. In common with many substantial properties on the Bury Road, Mesnil Warren was once a racing lodge, originally with a stable yard to one side.\n\nThe current property offers spacious, flexible accommodation which is particularly suitable for family occupation together with space for guests including a large self contained flat on the second floor of the original house featuring a sitting/dining room with a balcony giving distant views over the gardens and gallops.\n\nThe current owners have carried out extensive redecoration works and altered the layout to the kitchen which has been combined with an adjacent room to form a large kitchen/ breakfast/dining room with direct access to the garden. Of particular note is the fine main drawing room which has a tall, panelled ceiling, open fireplace and wide bays to front and rear, which, together with the well proportioned sitting room and family room, all radiate from the reception hall.\n\nThe Lutyens wing was added to the north of the original house and is built of a mellow red brick with a characteristic plastered cornice beneath the tiled roof which incorporates integral lead lined guttering. Much of the ground floor in this part of the property has wood block parquet flooring including the kitchen which also has a full width glazed roof light, original built-in dresser and two interconnecting larders.\n\nAt first floor level within the Lutyens wing is a large reception room facing the garden which is currently used as a gym but has previously functioned as a billiard room and a music room. It has an open fireplace and also has access to the gardens via French doors and a flight of brick steps. The main bedroom within the original house has fine outlooks, a recently created fully fitted dressing room a refitted en suite bathroom and a connected bedroom or dressing room. On this floor there are two further bedrooms and a bathroom with roll top bath.\n\nThe remaining bedrooms are within the Lutyens wing and spread over two floors accessible from a second staircase.\n\nThe accommodation is shown in full detail in the attached floor plans.\n\nOUTSIDE\nThe property is approached through tall brick piers with a pair of remotely controlled electronic gates on the Bury Road. The shingled driveway winds through mature trees up to the front of the house where there is a large shingled parking area.\n\nThe gardens to the front of the house include a rose pergola, topiaried box hedging, level lawns and a number of fine mature trees, most notably a majestic Wellingtonia. Passing through a further pair of brick piers one is lead around to the garaging and workshop/machinery store with further parking. The floodlit hard tennis court is situated in front of the outbuildings.\n\nThe gardens to the rear of the house are beautifully landscaped, laid mainly to lawn and feature a “garden room” with glazed doors facing south. Along the northern boundary is a small orchard and attached to the southern elevation of the house is an original lean-to greenhouse.\n\nIn all 2.47 acres\n\nLocation\n\nMesnil Warren is situated on the eastern side of The Bury Road backing onto the Heath and Warren Hill gallops. Newmarket has excellent facilities including a large Waitrose supermarket and a full range of independent shops for everyday needs.\n\nNewmarket station is approximately 1.4 miles to the south west and has a direct rail link to the city of Cambridge taking around 22 minutes. Also, Cambridge North station is only approximately 10 miles away with trains into London Kings Cross taking from 55 minutes.\n\nNewmarket is famous as the Home of English Racing and the July & Rowley Mile race courses are situated at the southern end of the town together with Tattersalls bloodstock auctioneers.\n\nThere are good schools in the area including Fairstead House prep school in Newmarket and a full range of well regarded independent schools in Cambridge together with Culford at Bury St Edmunds. A number of other well regarded boarding schools are found within an hour and a half including Oundle, Uppingham & Stowe.\n\nFor the commuter access to the A14 is 2 miles distant leading to the M11.\n\nThe ‘high-tech’ university City of Cambridge offers a comprehensive range of shops and services including a full range of supermarkets, restaurants and specialist shops. The city has theatres, cinemas and extensive cultural and recreational amenities as well as the world leading university.\n\nSquare Footage: 10,232 sq ft\n\n\nAcreage: 2.47 Acres\n\nDirections\n\nFrom London proceed north up the M11 to Junction 9a and take the A11 north. Take the Newmarket exit and continue through Six Mile Bottom towards Newmarket. Continue into the town and at the War Memorial proceed straight across the roundabout into the Bury Road. Mesnil Warren is number 40 and is situated on the right hand side after about half a mile.\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_9",
        "UUID": "f0071a6b-f136-463b-a95c-bd356b3a1147",
        "Image": "https://media.rightmove.co.uk/66k/65243/127946558/65243_TMH78639_IMG_00_0000.jpeg",
        "Price": "£2,500,000",
        "Address": "Madingley Road, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nThis multi-award-winning, high specification eco-house was designed by the acclaimed architect Meredith Bowles of Mole Architects in 2011. It occupies a quiet and secluded position on Madingley Road, in the western section of the Conservation Area of Cambridge, and extends to over 2,460 sq ft. The internal living space follows a single storey L-shaped plan designed around an internal south-facing garden with a rare Liquidambar tree at its centre. The design takes an exacting approach to light and space, with a focus on natural materials and energy efficiency to support sustainable modes of modern living.\n\nThe Architect\n\nThe celebrated architect Meredith Bowles founded Mole Architects in 1996. The practice has received numerous awards for its innovative approach to design, including the highly prestigious RIBA Manser Medal (2004) for Meredith’s own home which was deemed the best one-off house by an architect in the UK. This particular house won two RIBA awards in 2012, for its exceptional sustainability and ‘Spirit of Ingenuity’. Meredith lectures widely and is active in promoting sustainable design.\n\nThe Tour\n\nThe house is set back from Madingley Road, amongst an area of tree-filled gardens on the western edge of Cambridge. It is uniquely concealed behind a brick gatehouse extension, which houses a workshop and garage that provides private off-street parking. Designed around a number of existing trees protected by a tree preservation order, displacement pile foundations were chosen to create minimum disturbance to the roots.\n\nThe house was constructed using a timber frame, with clay blocks providing thermal mass, glulam beams supporting the roof space and a series of integrated ambient energy sources ensuring excellent energy efficiency. Rainwater is harvested and stored in a tank underground, solar panels are used for hot water supply and the underfloor heating is generated from a ground source heat pump. There is also mechanical ventilation with a heat recovery system and low energy lighting fitted throughout. External ‘green walls’ are combined with timber cladding and insulated with hemp inside wood fibre panels for breathability. A green sedum roof spans the easterly wing for additional insulation and biodiversity.\n\nThe primary entrance leads directly into a single south-facing corridor that provides circulation to all areas, while retaining a direct visual connection to the garden from every room. The kitchen and dining room are arranged in an open-plan layout, with sliding glass doors opening the entire space onto the internal courtyard. There is an interconnected utility space and pantry store, and a study positioned adjacently. The arterial corridor features deep bay windows which provide a lovely, quiet spot for reading or enjoying the view with a morning coffee; they could even be used as sleeping areas for visiting children.\n\nThe three bedrooms are beautifully proportioned; each has an excellent provision of built-in storage and views onto hidden courtyards. Two of the bedrooms have direct access to the garden. The main bedroom has a large en suite bathroom, with a garden view from the bath through a strategically placed low letterbox window. A family bathroom is flanked by the two other bedrooms and has a cleverly conceived mirrored skylight overhead, which frames a view of the Liquidambar tree.\n\nThe beautifully light, open-plan living space is located on the westerly wing of the house, where a large log-burner forms a natural focal point to the room. A ribbon of clerestory glazing and a wall of timber-framed glass walls invite an exceptional quality of natural light to flood through; in the summer months, the entire space can be opened onto the garden.\n\nOutdoor Space\n\nThe outside space is an immersive celebration of local wildlife, rich in biodiversity and teeming with flora and fauna; ducks make daily visits, as do plenty of birds, 19 species of butterflies, newts and dragonflies, which are drawn to the nature pond. There is an additional garden studio that offers excellent flexibility of use, easily befitting an additional home workspace, music studio or overflow accommodation.\n\nThe Area\n\nThe house can be found on Madingley Road on the westerly side of Cambridge, around 20 minutes’ walk from the centre and conveniently located near many of the university buildings. Although the city is relatively intimate in scale, it has a superb selection of shops, dining opportunities and cultural events, with Kettles Yard and The Fitzwilliam Museum notable highlights.\n\nThere are plenty of green open spaces within easy reach and delightful walking routes towards the River Cam, with Granchester meadows offering opportunities for wild swimming. Cambridge is world-renowned for its university and the quality of its historic architecture, yet is also increasingly recognised as an international business hub, thanks to its growing technology and science industries.\n\nA direct train service runs from Cambridge to London St Pancras in approximately 50 minutes. Extensive intercity bus services also operate within minutes walk from the house. The motorway network is also easily accessed, with the M11 around one and a half miles away.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_10",
        "UUID": "b3cd304c-3d57-4101-adf7-57969b91ee11",
        "Image": "https://media.rightmove.co.uk/193k/192446/118051925/192446_NEST_RM_192446_1952030_IMG_34_0000.jpeg",
        "Price": "£2,500,000",
        "Address": "Knapwell, Cambridge, CB23",
        "Type": "Detached",
        "Description": "Property description\n\nUPCOMING OPEN HOUSE: 23rd July 12pm. Take a tour around one of the best properties Cambridge has to offer with free food and sparkling wine. Secure your spot on the guest list today, Email or send a Whatsapp to\n\nGUIDE PRICE: £2,500,000 - £2,750,000 Option to purchase the Business park land & Buildings to the rear of the property for an additional £2,500,000\n\nKey Features\n\nDetached Period Home\n7 Bedrooms\n5 Bathrooms\n4 Reception Rooms\nSelf Contained Annex\nAir-conditioned Triple door garage\nDetached Leisure Barn/Studio\n3.5 Acre Plot\nBespoke conservatory\nWell-regarded Village location\nPotential revenue stream\nNo onward chain\n\n\nNest Seekers International is proud to present Knapwell Wood Farm, an impressive example of 18th-century architecture.\n\nSituated in the desirable South Cambridgeshire village of Knapwell, just 10 miles from the City of Cambridge, one of the world's most iconic university cities, Knapwell Wood Farm is a beautifully renovated period home, vastly improved by the current owners. The house offers a blend of spacious accommodation, uncompromising quality and restored period features.\n\nWith tree-lined grounds of around 3.50 acres, the house enjoys a peaceful rural setting, boasting a stunning brickwork exterior and bespoke sash windows fitted throughout, displaying elegant craftsmanship.\n\nImmediately, as you enter the private driveway, you will notice the air-conditioned triple door garage with separate office, alongside a generously sized self-contained annex and another large office with a high ceiling and exposed beams.\n\nThe main house is arranged over three floors of living accommodation, offering just over 4,700 square feet. You are greeted with a huge country-style kitchen including a full size Aga cooker, leading into the bespoke conservatory which looks out onto the rear courtyard-style garden. Adjoining the conservatory, you will find a separate utility room. Next to the rear garden is a detached air-conditioned leisure barn complete with bi-folding doors and a separate wet room.\n\nThe main living room offers a stunning fireplace and a beautiful bay window overlooking the grounds. The charming front elevation is south facing meaning you will enjoy sunlight throughout the entire day. Through the entrance hall, you will find the library with bespoke shelving and an exposed brick fireplace. You will also find a large separate dining room with French doors leading to the side patio where you’re met with one of two ponds. This feeds the irrigation system for the rear garden.\n\nThe reception rooms boast a plethora of period features and wood burning stoves along with a well-appointed wine cellar. With multiple office spaces and multi-purpose rooms, this home offers a tranquil space for those wanting to work from home.\n\nThe first floor has its own sitting area and four very generously sized bedrooms, each with its own en-suite facilities. The principal bedroom includes a freestanding slipper bath. The top floor has a further three bedrooms with original features, views onto the grounds and a separate family bathroom.\n\nThe current owners have run a very successful 5* Bed & Breakfast and hosted multiple wedding receptions. It quickly moved up the ranks to become one of the highest-rated Cambridgeshire B&B's on Tripadvisor. There is a separate wing with its own entrance consisting of 3 bedrooms, making this the perfect home for those looking to benefit from an additional income stream. The B&B has welcomed guests from all over the globe; individuals, couples, business executives and families alike, meaning a successful B&B in this area has the opportunity to achieve upwards of £75k per year with plenty of room for uplift.\n\n\nSeller Insight\n\n“We bought the property in January 2003 but didn’t move in until the following November as we had to carry out a mammoth renovation project. We updated everything from the electrics and plumbing to the kitchen and bathrooms, all the plaster was stripped off the walls, all joists were pulled out and as the stairs had fully collapsed we had them beautifully remade. We’ve enhanced the property further by adding a triple garage and office with air-con and heating, a bespoke hand-made conservatory, a large separate gym building complete with air-con and heating. We also enlarged the kitchen reinstating the old well within the new extension and converted the stable into a beautiful one-bedroom self-contained annex.\"\n\n“The house really comes alive when it’s filled with family and friends. The grounds have also provided a wonderful backdrop to countless alfresco get-togethers, and a great place to relax, particularly while catching the evening sunsets”.\n\n“The standout room is possibly the kitchen – we have a kitchen table that seats ten and a gorgeous Aga which creates a warm and welcoming atmosphere. We love to host dinner parties and the kitchen is the perfect place for entertaining.”\n\n“Seventeen years ago, we set up a B&B as the house has a separate front staircase leading to three en-suite bedrooms. We’ve also had five weddings in the garden with marquees and caterers for guests, we’ve held countless big birthday and wedding parties for our families. We also held a charity ball here for over 170 guests to raise vital funds for the Cambridge Children’s Hospice - it’s a property that has endless possibilities.”\n\n\nLocation\n\nKnapwell is a beautiful village just 10 miles from the city of Cambridge and approx. 6 miles from St Ives. Locally, you will discover a variety of retail, well-regarded pubs, restaurants and leisure facilities including a spa and golf club. A short stroll will take you to Knapwell Woods where you will see a display of bluebells in early spring and a fantastic place for family adventures.\n\nSchools\n\nFor families, Knapwell is a short distance from Elsworth primary school, Swavesey Village College & Cambourne Village College (both Ofsted rated “outstanding”) alongside a number of highly-rated independent schools in Cambridge for all age groups. The Perse School and Hills Road Sixth Form College (one of the top performing state sixth forms in the UK) are just 10 miles away.\n\nTravel\n\nWith excellent links to London and the North, St Neots train station is just a 15-minute drive, whilst there is easy access to the A1/M11 for direct links to London and Stansted Airport. Madingley Park & Ride is also a short drive away, offering easy access into central Cambridge.\n\nEast-West Rail is considering a number of proposals for a rail link between Bedford and Cambridge. They consulted on five route options in 2019. If approved, they aim to begin construction in 2025. One of the options could include a brand new train station in Cambourne, less than a 5 min drive from Knapwell, providing quicker and cheaper connections to science parks, universities and industry.\n\n\n\nAdditional Information\n\nPlanning permission has been granted to convert the neighbouring barns into a small number of high-end commercial offices that will be in keeping with the surroundings (not included within the sale of Knapwell Wood Farm). The existing dutch barn will be demolished, the existing entrance is to be moved and a new line of hedging will be planted, please find a CGI image attached.\n\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_11",
        "UUID": "3efdbd4e-ea92-49e0-b8f8-752f3136ebb9",
        "Image": "https://media.rightmove.co.uk/10k/9527/127382792/9527_100539081196_IMG_00_0000.jpeg",
        "Price": "£2,500,000",
        "Address": "Maids Causeway, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nA unique opportunity to purchase a substantial grade II listed classic regency townhouse part of Charles Humphrey's Dolls House development, offering well proportioned and versatile accommodation extending to about 3175sqft. In this prestigious central city location with far reaching views over midsummer common and river. This fine home benefits from its own enclosed front and rear landscaped garden.  \n\nFOUR PANELLED TIMBER ENTRANCE DOOR with entrance portico leading to: \n\nRECEPTION HALLWAY staircase to upper and lower floors, newel post and spindles, decorative moulded archway, ceiling with inset downlighters, stone flooring with recessed matwell. \n\nDRAWING ROOM marble fireplace with gas fired cast iron stove, decorative ceiling rose, moulded cornicing, picture rail, double panelled radiator, walk-in storage cupboard, large secondary sash window to the front with shutters and twin French glazed door to the rear with balcony. \n\nSITTING ROOM walk-in storage cupboard, moulded cornicing, moulded ceiling rose, picture rail, wall lights, double panelled radiator, large sash window to the front with secondary double glazed with shutters. \n\nKITCHEN/BREAKFAST ROOM with two oven gas fired Aga, granite working surfaces with matching upstands, undermount Franke sink unit, mixer tap, further range of cupboards and drawers, dishwasher, Miele oven and Miele microwave oven, Miele two ring gas hob, space for fridge/freezer, walk-in pantry with stone tiled floor and shelving, stone tiled floor, ceiling with inset downlighters, a pair of radiators, double glazed windows to the side and rear and twin glazed doors leading out to the garden. \n\nREAR HALL with coats cupboard, seat, double glazed windows, panelled and double glazed door leading to outside. \n\nINNER HALL with coat hooks, bookshelving, radiator, stone tiled floor. \n\nCLOAKROOM low level dual flush w.c., pedestal wash hand basin, tiling to splashbacks, mixer tap, radiator, stone tiled floor, ceiling with inset downlighters, extractor fan, double glazed sash window to the rear. \n\nLOWER GROUND FLOOR stone tiled floor, understairs storage cupboard, double panelled radiator, large walk-in storage cupboard. \n\nDINING ROOM ceiling with inset downlighters, bookshelving, double panelled radiators, secondary double glazed sash windows to the front and rear. \n\nUTILITY/BOOT ROOM A generous range of storage cupboards, working surfaces with butler style sink unit, plumbing and space for automatic washing machine, space for tumble dryer, double panelled radiator, tiled floor. \n\nON THE FIRST FLOOR  \n\nLANDING staircase rising to upper floors, sash window to the side, radiator, cupboard housing insulated hot water tank and slatted shelving. \n\nBEDROOM 1 moulded cornicing, wall lights, fitted wardrobe cupboards, double panelled radiators, secondary double glazed large sash window to the front, double glazed sash window to the rear. \n\nBEDROOM 2 cast iron fireplace, fitted wardrobe cupboards, picture rail, double panelled radiator, secondary double glazed large sash window to the front. \n\nBATHROOM white three piece suite, mixer/shower tap, glazed shower screen, low level w.c., pedestal wash hand basin, storage cupboard, fitted mirror, courtesy light, double panelled radiator, large sash window to the front with shutters. \n\nBEDROOM 3 with moulded ceiling rose, moulded cornicing, wardrobe cupboard with shelving and hanging rail, double panelled radiator, further shelved storage cupboard, secondary double glazed sash window to the rear. \n\nSHOWER ROOM walk-in tiled shower, glazed shower screen, wall hung wash hand basin with mixer tap, dual flush w.c., heated towel rail, radiator, ceiling with downlighters, extractor fan, sash window to the side. \n\nBEDROOM 4 cast iron fireplace, access to loft space, double panelled radiator, fitted desk, shelving, secondary double glazed sash window to the rear. \n\nON THE SECOND FLOOR  \n\nLANDING access to loft space, double glazed Velux rooflight. \n\nBEDROOM 5 fitted cupboard and shelving, double panelled radiator, ceiling with downlighters, casement window to the front. \n\nBATHROOM white three piece suite, panelled bath, low level w.c. and pedestal wash hand basin, radiator, eaves storage, ceiling with downlighters, casement window to the front. \n\nBEDROOM 6 range of fitted cupboards, double panelled radiator, fitted bookshelving, casement window to the front. \n\nOUTSIDE Gated access with Yorkstone paved pathway to front door, box hedging, flower and shrub beds and borders.\n\nRear garden with gated access to the rear, garden has been landscaped with lawned area, hedging, mature trees and shrubs, timber decked seating areas and eating area, Yorkstone paviours, enclosed by walling. \n\nLISTING MAID'S CAUSEWAY 1. 942 (South Side) 26.4.50. Nos 8 to 18 (even) 29.3.62. No 20 TL 4558 NW 4/109 TL 4558 NE 5/109 II GV 2. Terrace of 6 houses connected by low brick walls. Each house similar; early C19; 2 storeys with attics; gault brick; mansard slate attics; symmetrically designed front; stone band at 1st floor window cill level and small moulded wood cornice below parapet; 3 windows (glazing bars missing from Nos 8 and 12). Doorcase with panelled pilasters and small pediment, 4 panelled door. No 12 has plaster porch with Doric columns and entablature. As Nos 4 and 6 (qv) Nos 18 and 20 have the appearance of being one house but have always been a pair. Part of Charles Humfrey's Doll's Close Development l815-26 (see also Short Street, Fair Street and Willow Walk). (RCHM 266). Nos 4 to 20 (even) form a group with No 1 Fair Street and No 1 Short Street. \n\nMATERIAL INFORMATION Tenure-Freehold\nCouncil Tax Band-H\n\n\n Brochures\nGlossy\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_12",
        "UUID": "87b8b3e9-41cd-4185-bf8a-b921653e0696",
        "Image": "https://media.rightmove.co.uk/10k/9527/126657533/9527_100539077880_IMG_00_0000.jpeg",
        "Price": "£2,500,000",
        "Address": "Newmarket Road, Stow-cum-quy",
        "Type": "Detached",
        "Description": "Property description\nThe Bury occupies a wonderful location at the end of a private driveway and is approximately 5 miles from the centre of the university city of Cambridge with a local public house and post office in Stow-cum-Quy along with extensive range of facilities including a range of shops, village college and sports centre and nearby popular village of Bottisham. Stow-cum-Quy is also well placed for access to major routes providing access to Cambridge, city centre and beyond via the A11, A14 and M11. The property sits in its own delightful established grounds extending to 3.8 acres. The private sweeping hedge lined driveway is accessed via electronic gates and leads to an extensive gravelled parking area with a range of open cart lodge garaging and closed storage. There are an extensive range of outbuildings which have been converted for use as offices for a range of small businesses. \n\nSET OF STEPS leading to an attractive Portico with large timber panelled door with fanlight over to: \n\nRECEPTION HALL An elegant space with a fine sweeping staircase to the first floor, exposed floorboards and tiled flooring, dado rail and plaster cornicing, deep skirting boards and attractive timber panelling with door giving access to the lower ground floor. \n\nDINING ROOM An impressive room with two large multi-pane sash windows to two aspects with open brick fireplace and hearth, decorative mantel and surround, plaster cornicing, wall light points, dado rail. \n\nDRAWING ROOM An elegant room with large multi-pane sash window affording views of the grounds, deep skirting boards, picture rail, plaster cornicing, open brick fireplace with hearth and decorative mantel and surround, French doors leading to:  \n\nLARGE DOUBLE GLAZED CONSERVATORY with panoramic views of the gardens, tiled flooring, two pairs of double glazed French doors to the rear and side deck. \n\nSTUDY with a range of fitted shelving to two walls, further fitted cupboards, part glazed doors to rear lobby, multi-pane sash window to side, fireplace with decorative hearth. \n\nLOBBY with quarry tiled flooring, window to each side, panelled timber door to the side. \n\nCLOAKROOM with stripped wooden floorboards, low level w.c., pedestal wash hand basin, Velux rooflight. \n\nKITCHEN/BREAKFAST ROOM with a range of bespoke wall and base units, working surfaces with space for Aga with canopy hood over, twin Belfast sinks with mixer taps, multi-paned window to the side, fitted plate racks, range of glazed display cabinets, inset spotlights, exposed floorboards and space for range of appliances, plaster cornicing, large central island with stone working surfaces with range of storage under, along with plumbing and space for dishwasher and wine rack, multi-paned French doors to the garden, multi-paned bay window to the rear, further glazed door to the rear and door to large shelved pantry with window to rear. Large Utility Cupboard with plumbing for washing machine, countertop with sink and Velux roof lighting. \n\nSNUG with quarry tiled floor, impressive Range with mantel over, multi-paned window to side, timber door to rear lobby with large timber door to side, door to: \n\nBOOT ROOM with stripped wooden floorboards, Velux rooflight, range of wooden units with worktops, large Belfast sink, window to side. \n\nACCESS FROM SNUG to a rear stairwell leading to additional accommodation including: \n\nON THE FIRST FLOOR  \n\nLANDING with window to rear, stairs to second floor. \n\nDOUBLE BEDROOM with multi-paned sash window to side, recessed cupboard, cast iron fireplace, radiator. \n\nBATHROOM with three piece suite, window to side, low level w.c., pedestal wash hand basin, panelled bath, tiled splashbacks, radiator. \n\nON THE SECOND FLOOR  \n\nBEDROOM with multi-paned window to rear, two Velux rooflights, radiator, door to further: \n\nBEDROOM/STORE with Velux rooflight, range of exposed timbers and steps leading to loft. \n\nLOWER GROUND FLOOR accessed via the entrance hall with tiled flooring and door to: \n\nLIVING ROOM with multi-paned French doors and windows to the side with polished tiled flooring, fitted with a range of wall and base units with range of appliances, granite working surfaces, inset sink and mixer taps, inset spotlights. \n\nBATHROOM fully tiled, three piece suite with panelled bath, wall mounted shower and controls, low level w.c., vanity wash hand basin, cupboard under, mixer tap, range of storage. \n\nBEDROOM tiled flooring, multi-paned window to front, radiator, range of spotlights. \n\nFIRST FLOOR OF THE MAIN HOUSE  \n\nATTRACTIVE GALLERIED LANDING with dado rail, plaster cornicing, multi-paned coloured glass sash window to rear, stairs to second floor with understairs storage cupboard. \n\nBEDROOM 1 with multi-paned sash windows to two aspects affording wonderful views of the gardens and beyond, brick fireplace with decorative mantel and surround, picture rail, plaster cornicing, radiator, door to: \n\nENSUITE fully tiled with Travertine tiling, multi-paned sash window to the side, radiator, large shower enclosure with sliding doors, wall mounted shower and controls, wash hand basin with mixer tap, low level w.c., whirlpool bath with mixer taps. \n\nBEDROOM 2 with multi-paned sash windows to two aspects, built-in double wardrobe, brick fireplace with decorative mantel and surround, picture rail, plaster cornicing, radiator. \n\nBEDROOM 3 with multi-paned sash window to the front, plaster cornicing, picture rail, radiator. \n\nBEDROOM 4 with multi-paned sash window to the side, brick fireplace, decorative mantel and surround, fitted cupboard, radiator. \n\nFAMILY BATHROOM A contemporary suite with tiled shower enclosure, wall mounted controls, drencher shower head over, low level w.c., wash hand basin with mixer tap, chrome heated towel rail, fully tiled with polished porcelain tiles, window to rear, inset spotlights, plaster cornicing, fitted mirror, cupboard containing large hot water cylinder. \n\nON THE SECOND FLOOR  \n\nLANDING with storage cupboard with hot water cylinder, Velux rooflight. \n\nLOFT ROOM with range of exposed structural timbers, Velux rooflights to two aspects, radiator, door to: \n\nENSUITE BATHROOM with three piece white suite comprising low level w.c., pedestal wash hand basin, panelled bath, tiled splashbacks, Velux rooflight and radiator. \n\nOUTSIDE The gardens which are a particular feature of this fine home features sweeping grounds to the front and side of the property with attractive ornamental pond and wide range of established specimen trees along with numerous fruit trees and orchard. Winding pathways lead to a hard tennis court with seating and timber pavilion with further gardens to the side of the property providing ample space for entertaining and extensive paved patio area. \n\nDETACHED GATEHOUSE  \n\nHALLWAY with multi-paned door to the front, window to side. \n\nCLOAKROOM with low level w.c., vanity wash hand basin with mixer taps, tiled splashbacks, window to side. \n\nSITTING ROOM with multi-paned French doors to the gardens, window to side and rear, two radiators. \n\nKITCHEN/DINING ROOM with range of fitted wall and base units, range of fitted appliances including fridge/freezer, dishwasher, double oven, range of windows to three aspects, halogen lighting, stairs to first floor. \n\nON THE FIRST FLOOR  \n\nLANDING with Velux rooflight. \n\nBEDROOM 1 vaulted ceiling with windows to two aspects, radiator. \n\nBEDROOM 2 with window to rear, radiator. \n\nBEDROOM 3 with window to rear, radiator, part vaulted. \n\nBATHROOM with three piece white suite comprising low level w.c., wash hand basin, panelled bath with screen, tiled surround, double glazed window to front, radiator. \n\nOUTSIDE There are excellent gardens mainly laid to lawn, well screened with fencing and established hedging. \n\nSERVICES Mains water and electric are connected. Oil fired central heating. Septic tank drainage. \n\nMATERIAL INFORMATION Tenure - Freehold\nCouncil Tax Band - H \nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_13",
        "UUID": "fd1a3439-a2f5-4e3e-b282-c7ad26caec24",
        "Image": "https://media.rightmove.co.uk/51k/50428/127433051/50428_FCY220036_IMG_22_0000.jpeg",
        "Price": "£2,000,000",
        "Address": "High Street, Hemingford Grey, Huntingdon, Cambridgeshire, PE28",
        "Type": "Detached",
        "Description": "Property description\nOne of the hallmark properties of this sought-after village, sitting on a generous plot including a riverside garden and mooring. Located at the end of the High Street with no passing traffic, the handsome front façade, draped by a mature wisteria, looks out onto the meandering River Ouse.\nA low level brick wall with cast iron railings and gate opens onto a mature front garden with lawns flanking a path to the front door. Guests and owners are greeted by the symmetrical grandeur of the beautiful home.\n\nA generous reception hall with wood block flooring and stairs featuring an arched window opens onto the three principal reception rooms and kitchen/breakfast room. Both the dining room and drawing room enjoy elegant proportions and fireplaces with the sitting room also boasting French doors to the south facing garden room with mature vine and access to a large terrace. The largest of the reception rooms was once the studio of Walter Denby Sadler, this grand space with a vaulted ceiling, oversized picture window flooding the space with natural light and walk out box bay window. The dual aspect kitchen breakfast room is the heart of the home and sits alongside pantry, utility, cloak and lobby.\n\nThe first floor comprises the principal bedroom with access to the landing, bathroom with separate WC and three further bedrooms. The second floor comprises the remaining four bedrooms and a further bathroom. As with the ground floor, there are numerous fireplaces and period features throughout the bedrooms. They also benefit from charming garden and river views.\n\nThe formal gardens offer exceptional privacy with an abundance of mature specimen trees and well stocked mixed borders. A sweeping lawn and gravel path edged with box hedging leads to a lightly wooded area with fountain. There is also a thatched summer house and double garage with storage above which could make an excellent annexe subject to the relevant consents. There is also a garden store. The riverside plot is secure with a brick wall and railings. There is a charming thatched boathouse and lawns, a perfect spot to enjoy the occasional passing boat and abundance of wildlife.\nHemingford Grey is well served with a village pub, shop and primary school. Nearby St. Ives offers further amenities including a guided bus to historic Cambridge while London can be reached by Huntingdon Train Station.\n\nSeller Insight\n\n“River House is rich in history and has been home to some notable people of interest, including Walter Dendy Sadler who was a founding member of our local regatta and one of the first artists acquired by Henry Tate for his collection of paintings. Lt. Col. Hayward followed (1923 – 1943) during which time he donated the playing field to the village, followed by the Glyn banking family (1943 – 1976) and then us,” say the owners.\n\n“Being a local boy, I had always known of the exceptional position and fine Georgian architecture of River House with its enclosed garden, riverside access, and thatched boathouse. It’s a true family home that is light and spacious, yet welcoming and cosy. We were fortunate enough to acquire it in 1976.”\n\n“We have an award-winning restaurant/pub, good village shop and Post Office within easy walking distance, as well as circular river walks, bike riding opportunities, and public access for fishing and water sports. We enjoy easy access to the North Norfolk coast, Cambridge, and Huntingdon which offers frequent trains to London. We have a thriving sports and social club, sports facilities, children’s sports days, and the annual regatta that has been held since 1904. Groups are wide and varied and our well-attended Church has community rooms and a café.”\n\n“Our garden is enclosed and has lawns, herbaceous borders, and a natural area. We are surrounded by trees, including beech, oak, and a very old mulberry tree. The Studio has allowed for two wedding receptions where we seated 76 guests and has played host to music recitals and large family gatherings. We can easily accommodate a marquee in the garden where we have held breakfast parties, jazz evenings, village society events, and special birthdays with hog roasts and so on.”\n\n“For him, the green panelled room with its open fire on a crisp, cold day or evening is the best place to spend time gazing up river, perhaps with a glass in hand, whilst for her, it’s those peaceful moments curled up on the sofa close to the AGA in the kitchen with a book in hand. This has been a lovely house to live in and it’s been a very happy home. Aesthetically very pleasing with spacious, bright rooms, and views over the river from all the bedrooms. We’re going to miss it when we leave, especially the beautiful garden, but it’s time for us to downsize and for a new family to fill the house and enjoy everything it has to offer.”\n\nVillage information\n\nThe Hemingfords (Hemingford Grey and Hemingford Abbots) are situated along the banks of the River Great Ouse and are well-known as very picturesque and sought-after Cambridgeshire villages with beautiful river walks and footpaths to St Ives. Much of the villages are within a Conservation Area with many thatched cottages and barns and other architecturally important buildings, including the Grade I Norman Manor House in Hemingford Grey and the Grade I listed church in Hemingford Abbots.\n\nHemingford Grey has a wide range of facilities including the Award winning “Cock” pub, village shop “Budgens”, Post Office, children’s play area, 12th Century church, Church hall, Coffee shop, Primary school, Pavilion sports club with facilities for tennis, squash, cricket, football, bowls and a variety of social clubs and activities.\n\nThe sister village, Hemingford Abbots, also has the “Axe & Compass” pub, an all purpose-built Village Hall, playing field equipped with children’s play equipment and a golf range/course. Between the two villages there are a wide range of clubs, societies and activities such as the annual Regatta and biennial Flower Festival.\n\nTransport\n\nHemingford Grey sits between the towns of Huntingdon about 6 miles, and St Ives about 2 miles, where a wider selection of shops, restaurants and leisure facilities are available. The newly modified A14 provides quick and easy access into Cambridge and links to the A1, M11 and the national motorway network. Huntingdon has a railway station approx. 10 minutes’ drive away, with fast trains into London King’s Cross in around 52 minutes and links to the North via Peterborough whilst St Ives offers the Guided Busway service to the Cambridge Science Park, city centre and Addenbrookes Hospital.\n\nSchools\n\nThere is a good selection of primary schools within 1-1.5 miles including: Hemingford Grey Primary. There are also several well-regarded secondary schools in the neighbouring towns such as Hinchingbrooke schools in Huntingdon and St Ivo Academy in St Ives. Independent schools in Cambridge and Kimbolton are also within easy reach.\n\nAgents Information\n\nTenure: Freehold\nYear Built: Early 1700s\nEPC: Exempt – Grade II* Listed\nLocal Authority: Huntingdon District Council\nCouncil Tax Band: H\nA public footpath separates the main house and riverside garden.\n\nIMPORTANT NOTE TO PURCHASERS:\nWe endeavour to make our sales particulars accurate and reliable, however, they do not constitute or form part of an offer or any contract and none is to be relied upon as statements of representation or fact. Any services, systems and appliances listed in this specification have not been tested by us and no guarantee as to their operating ability or efficiency is given. All measurements have been taken as a guide to prospective buyers only, and are not precise. Please be advised that some of the particulars may be awaiting vendor approval. If you require clarification or further information on any points, please contact us, especially if you are traveling some distance to view. Fixtures and fittings other than those mentioned are to be agreed with the seller.\n\nFCY220036\nBrochures\nWeb Details\nFull Brochure PDF\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_14",
        "UUID": "a037da73-4053-4084-8ee3-4cc3b0583d96",
        "Image": "https://media.rightmove.co.uk/182k/181895/84901869/181895_5_KnghtsPrk-Plt249_IMG_00_0001.jpeg",
        "Price": "£1,999,950",
        "Address": "Eddington Avenue, Cambridge, CB3",
        "Type": "Detached",
        "Description": "Property description\n\nA prestigious collection of luxurious 5 bedroom detached villas offering Impeccable design and specification.\nThe Trinity, Plot 249 offers expectational accommodation across three floors, with the five bedroom modern home spreading across approx. 3,126 sq ft making it the perfect family home.\n\n\nThe large family room at the front of the house is the perfect space for everyone to gather, leading into the stunning kitchen diner with its island and double doors opening onto the garden. On the first floor is another generous living room and three double bedrooms, one of which features a dressing room and en-suite bathroom. The second floor is truly luxurious, with two double bedroom suites opening out onto a spectacular terrace, the ideal spot for a morning coffee or evening drink.\n\n\nOverview of key information about this property and the potential costs for your new home. Plot 249 is a freehold property with no ground rent fees. Please note council tax bands are often not released by the local authority until the property is complete, further information will be provided once available.\n\n\nTenure: Freehold\nCouncil Tax Band:  TBC\nEstate Charge: £2,303.55\nEstate Charge Review Period: Annual\n\n\n*Exterior image is a CGI and for indicative purposes only.\n\n \nplot 249\nKitchen/Dining Room - 4.65m x 7.1m (15'3\" x 23'4\")\nFamily Room - 5.3m x 6.6m (17'5\" x 21'8\")\nLiving Room - 5.35m x 7.25m (17'7\" x 23'9\")\nBedroom 3 - 4m x 4.8m (13'1\" x 15'9\")\nBedroom 4 - 3.3m x 4.2m (10'10\" x 13'9\")\nBedroom 5/Study - 3.3m x 3.4m (10'10\" x 11'2\")\nMaster Bedroom - 3.9m x 7.1m (12'10\" x 23'4\")\nBedroom 2 - 3.9m x 7.1m (12'10\" x 23'4\")\n\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_15",
        "UUID": "9ea09ee8-56ca-4412-83a4-ee14c772e2c0",
        "Image": "https://media.rightmove.co.uk/48k/47865/85190922/47865_NCA220170_IMG_00_0000.jpeg",
        "Price": "£1,999,950",
        "Address": "Athena At Knights Park, Eddington Avenue, Cambridge",
        "Type": "House",
        "Description": "Property description\n** SHOW HOME OPEN **\n\nPlot 249 The Trinity\nAthena at Knights Park\nEddington\nCambridge\nCB3 1SE\n\n\nThe Trinity is a stunning 5 bedroom detached home within this exclusive collection of villas, forming part of the Knights Park homes at Athena.\n\nBrought to the development by award winning developer Hill, these homes provide over 3126 sq ft of family living, on the edge of Cambridge and within the sought after Eddington development.\n\nThe area is already a hugely popular area of the city, not only because of the University of Cambridge Primary School which is situated just opposite Knights Park. The access into and around Cambridge from this location is excellent. Whatever your choice of transport there are easy routes into and around the city.\n\nThe property provides accommodation over three floors:\n\nGround Floor\nKitchen/dining room : 4.65m x 7.10m 15’3” x 23’3”\nFamily room : 5.30m x 6.60m 17’4” x 21’6”\n\nThere is also a separate utility room with WC situated off the kitchen/dining room and further storage in the hallway.\n\nFirst Floor\nLiving room : 5.35m x 7.25m 17’5” x 23’8”\nBedroom 3 : 4.00m x 7.10m 13’1” x 23’3”\nBedroom 4 : 3.30m x 4.20m 10’8” x 13’8”\nBedroom 5/study : 3.30m x 3.40m 10’8” x 11’2”\n\nSecond Floor\nMain bedroom : 3.90m x 7.10m 12’8” x 23’3”\nBedroom 2 : 3.90m x 7.10m 12’8” x 23’3\nDressing Room\n\nThe Trinity also has an integral garage with additional parking space.\n\nThese homes are finished with superb quality and excellent attention to detail. The specification includes:\n\nKitchen\n* Matt finish kitchen units with soft close to doors and drawers\n* Quartz worktops and matching upstands\n* Siemens induction hob with glass splashback\n* Siemens integrated single oven\n* Siemens integrated combi oven/microwave\n* Siemens integrated warming drawer\n* Bosch integrated fridge and freezer\n* Integrated wine cooler\n* Bosch integrated dishwasher\n* LED feature lighting to wall units\n\nUtility Room\n* Units and worktops to compliment kitchen\n* Bosch washing machine and condenser dryer\n\nBathroom and En Suites\n* Duravit sanitary ware\n* Hansgrohe taps and showers\n* Mirrors with LED lighting\n* Large format wall and floor tiles\n* Heated chrome towel rails\n\nFloor Finishes\n* Engineered wood flooring to ground floor and first floor living rooms\n* Carpet to stairs, landings and bedrooms\n* Large format tiles to bathrooms and en suites\n\nDoors and Windows\n* Aluminium clad or glazed front door with multipoint locking system\n* High efficiency triple glazed aluminium/timber composite windows and doors, finished white inside\n\nHeating and Water\n* Underfloor heating throughout\n* Heated chrome towel rails to bathroom and en suites\n* Heating and hot water via district heating, metered to each property\n* Mechanical ventilation and heat recovery\n\nWarranty\n* 10 year NHBC Warranty\n\nWell Located\nKnights Park at Athena is ideally positioned in between the Madingley and Huntingdon Roads. Access into central Cambridge is convenient by bike, car, bus or foot. There are ample cycle ways around the city.\n\nThe west of Cambridge also provides easy access via the M11 straight to Junction 11 and into the south of the city - either for Addenbrooke's Hospital/Biomedical campus or for many of the city schools.\n\nThe U-Bus also provides a convenient shuttle service between many of the research parks and picks up from Eddington.\n\n** LIMITED AVAILABILITY ON THESE HOMES....Contact today to discuss your requirements **\n\n*Exterior image is a CGI and for indicative purposes only.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_16",
        "UUID": "1c0a39fb-a3cf-4e0f-a713-2370345d22c0",
        "Image": "https://media.rightmove.co.uk/37k/36227/127282331/36227_CAS220291_IMG_02_0000.jpeg",
        "Price": "£1,950,000",
        "Address": "Mill Lane, Stetchworth, Newmarket, Suffolk, CB8",
        "Type": "Detached",
        "Description": "Property description\nA handsome detached early Victorian village residence with mature parkland gardens.\n\nDescription\n\nMill House is a handsome, detached well-presented early Victorian village house which enjoys an elevated position with delightful south facing views over and beyond its mature parkland-like grounds extending to 2.09 acres. With brick elevations beneath a slate roof, this sought after spacious period property is tucked away with its own private drive and has been upgraded by the vendors with Fired Earth tiles and sanitary fittings and the replacement of some of the ground floor doors and windows. Many features of the period remain including sash windows, deep skirtings and cornicing, high ceilings and open fireplaces. Particular features of this fine house are the welcoming reception hall, well-proportioned reception rooms, including the impressive triple aspect drawing room with open stone fireplace that was carved by a Norfolk stonemason, a superb kitchen/dining room with Aga with adjacent orangery and a cosy snug sitting room.\n\nIn addition there is a useful utility room, pantry and cloakroom and the large cellar provides storage and wine bins.\n\nThe elegant staircase leads to a wide landing and four generously sized bedrooms on the first floor, all with en suite bath or shower rooms, and there are another two suites with separate ground floor access, one of which is used as an office and adjoins the garage.\n\n\nOutside\nMill House is approached over a sweeping gravel driveway laid with Purbeck stone chippings leading to parking for several cars and access to the garage, guest suite and office.\n\nThe attractive mature grounds are a particular feature of the property and offer a high degree of privacy. The gardens are predominantly laid to lawn with a lavender lined pathway laid with Cotswold stone chippings, leading to a six metre long rose arbour and focal point at the far end, an orchard and an impressive variety of mature specimen trees including cedar, Wellingtonia and beech, creating a wonderful parkland feel.\n\nA large raised paved terrace adjoins the rear elevation with steps down to the lawn where there is a further terrace for entertaining with box hedging, outside lighting and outside tap. There are a number of useful outbuildings including a lockable brick built outbuilding and lean-to garden store.\n\nLocation\n\nStetchworth is a popular Cambridgeshire village with good local amenities including a highly regarded village school and nursery, sports centre with tennis and squash courts and a Post Office/shop.\n\nThe neighbouring village of Dullingham has a railway station, one stop from Cambridge.\n\nNewmarket, approximately 3.8 miles away, offers an extensive range of amenities including schools, shops, supermarkets, restaurants and leisure facilities, including health clubs, a swimming pool and golf club.\n\nNewmarket is world famous as the headquarters of British racing and is home to many racing institutions including the National Stud, the National Horseracing Museum, Tattersalls and the Jockey Club. Some of the finest racing in the world is seen on Newmarket’s two racecourses: the Rowley Mile and the July Course.\n\nStetchworth is particularly commutable to the University City of Cambridge (approximately 15.1 miles away) with its burgeoning high-tech industries, science parks and reputable schools. There is excellent access to the A14 and A11 (M11). Cambridge, Audley End and Whittlesford offer direct rail lines into London, with the fastest trains taking under one hour. Stansted International Airport is approximately forty minutes’ drive.\n\nSquare Footage: 4,425 sq ft\n\n\nAcreage: 2.09 Acres\n\nAdditional Info\n\nCouncil tax band - G\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_17",
        "UUID": "4516a91e-8e4c-442c-9357-22b403040ee8",
        "Image": "https://media.rightmove.co.uk/182k/181895/127768460/181895_5_KnghtsPrk-Plt241_IMG_00_0000.jpeg",
        "Price": "£1,924,950",
        "Address": "Eddington Avenue, Cambridge, CB3",
        "Type": "Detached",
        "Description": "Property description\n\nAward-winning 5 bedroom detached Villa show home - winner of 'Best Family Home' by Evening Standard New Homes.\nDesigned by a professional Interior Designer this luxurious 5 bedroom detached villa is available with all furniture and fittings included and is ready to move in now.\n\n\nRecently awarded 'Best Family Home' by Evening Standard New Homes.\n\n\nThe Cavendish is ideal for an active and sociable family lifestyle, with its kitchen diner featuring a large island and flexible layout, including an upstairs living room and five generous double bedrooms is approx 2,710 sqft.\n\n\n\n\nLots of storage, as well as an integral garage, downstairs utility room and cloakroom, keep everything in its place.\n\nDoors lead from the kitchen diner to the private garden so you can connect easily with the outside. On the second floor, the master suite is a wonderful retreat, complete with dressing room, en-suite bathroom and its own balcony.\n\n\nOverview of key information about this property and the potential costs for your new home. Plot 245 is a freehold property. Please note council tax bands are often not released by the local authority until the property is complete, further information will be provided once available.\n\n\nTenure: Freehold\nCouncil Tax Band:  TBC\nEstate Charge: £2,587.35\nEstate Charge Review Period Annual\n\n\n*Exterior image is a CGI and for indicative purposes only.\n\n\n\n\n \nPlot 241\nKitchen/ Dining Room - 4.05m x 7.05m (13'3\" x 23'2\")\nFamily Room - 4.6m x 4.95m (15'1\" x 16'3\")\nLiving Room - 4.6m x 5.75m (15'1\" x 18'10\")\nBedroom 3 - 3.5m x 4.5m (11'6\" x 14'9\")\nBedroom 4 - 3.5m x 3.95m (11'6\" x 13'0\")\nBedroom 5/ Study - 3.3m x 4.7m (10'10\" x 15'5\")\nPrincipal bedroom - 3.4m x 4.6m (11'2\" x 15'1\")\nDressing Room - 2.65m x 2.65m (8'8\" x 8'8\")\nBedroom 2 - 4.65m x 4m (15'3\" x 13'1\")\n\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_18",
        "UUID": "71c71fda-47d4-4ff4-8b6c-065a5f883c5c",
        "Image": "https://media.rightmove.co.uk/48k/47865/128204258/47865_NCA220366_IMG_00_0000.jpeg",
        "Price": "£1,924,950",
        "Address": "Knights Park, Eddington Avenue, Cambridge",
        "Type": "House",
        "Description": "Property description\nPlot 241 The Cavendish\nAthena at Knights Park\nEddington\nCambridge\nCB3 1SE\n\n\nDesigned by a professional Interior Designer this luxurious 5 bedroom detached villa is available with all furniture and fittings included and is ready to move in now.\n\nLocated within this exclusive collection of villas, forming part of the Knights Park homes at Athena.\n\nBrought to the development by award winning developer Hill, these homes provide over 2700 sq ft of family living, on the edge of Cambridge and within the sought after Eddington development.\n\nThe area is already a hugely popular area of the city, not only because of the University of Cambridge Primary School which is situated just opposite Knights Park. The access into and around Cambridge from this location is excellent. Whatever your choice of transport there are easy routes into and around the city.\n\nThe property provides accommodation over three floors:\n\nGround Floor\nKitchen/dining room : 13'3 x 23'2\nFamily room : 15'1 x 16'3\nThere is also a separate utility room with WC situated off the kitchen/dining room and further storage in the hallway.\n\nFirst Floor\nLiving room : 15'1 x18'10\nBedroom 3 : 11'6 x 14'9\nBedroom 4 : 11'6 x 13'0\nBedroom 5/study : 10'10 x 15'5\n\nSecond Floor\nMain bedroom : 11'2 x 15'1\nDressing room : 8'8 x 8'8\nBedroom 2 : 15'3 x 13'1\n\nThe Cavendish also has an integral garage.\n\nThese homes are finished with superb quality and excellent attention to detail. The specification includes:\n\nKitchen\n* Matt finish kitchen units with soft close to doors and drawers\n* Quartz worktops and matching upstands\n* Siemens induction hob with glass splashback\n* Siemens integrated single oven\n* Siemens integrated combi oven/microwave\n* Siemens integrated warming drawer\n* Bosch integrated fridge and freezer\n* Integrated wine cooler\n* Bosch integrated dishwasher\n* LED feature lighting to wall units\n\nUtility Room\n* Units and worktops to compliment kitchen\n* Bosch washing machine and condenser dryer\n\nBathroom and En Suites\n* Duravit sanitary ware\n* Hansgrohe taps and showers\n* Mirrors with LED lighting\n* Large format wall and floor tiles\n* Heated chrome towel rails\n\nFloor Finishes\n* Engineered wood flooring to ground floor and first floor living rooms\n* Carpet to stairs, landings and bedrooms\n* Large format tiles to bathrooms and en suites\n\nDoors and Windows\n* Aluminium clad or glazed front door with multipoint locking system\n* High efficiency triple glazed aluminium/timber composite windows and doors, finished white inside\n\nHeating and Water\n* Underfloor heating throughout\n* Heated chrome towel rails to bathroom and en suites\n* Heating and hot water via district heating, metered to each property\n* Mechanical ventilation and heat recovery\n\nWarranty\n* 10 year NHBC Warranty\n\nWell Located\nKnights Park at Athena is ideally positioned in between the Madingley and Huntingdon Road. Access into central Cambridge is convenient by bike, car, bus or foot. There are ample cycle ways around the city.\n\nThe west of Cambridge also provides easy access via the M11 straight to Junction 11 and into the south of the city - either for Addenbrooke's Hospital/Biomedical campus or for many of the city schools.\n\nThe U-Bus also provides a convenient shuttle service between many of the research parks and picks up from Eddington.\n\n** LIMITED AVAILABILITY ON THESE HOMES....Contact today to discuss your requirements **\n\n* Photos of the Cavendish show home*\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_19",
        "UUID": "81e24167-17e4-4a79-9daf-a1b3919cfc73",
        "Image": "https://media.rightmove.co.uk/37k/36227/125262350/36227_CAS220252_IMG_03_0000.jpeg",
        "Price": "£1,900,000",
        "Address": "Park Road, Great Chesterford, Saffron Walden, Essex, CB10",
        "Type": "Detached",
        "Description": "Property description\nSubstantial country house in a superb commutable position.\n\nDescription\n\nConstructed in 2003, The Limes is a substantial classically designed house built of handmade Tudor style bricks imported especially from Belgium with lime mortar joints under a plain handmade clay tiled roof with re-constituted stone detailing.\n\nThe design is reminiscent of late Victorian/Edwardian architecture and particularly imposing and attractive. The house is positioned to take full advantage of the rolling countryside to the south and many of the main rooms enjoy delightful south facing aspects with distant views.\n\nThe accommodation (in the main house) extends to 3,912 sq ft and at ground floor level there is extensive solid oak flooring, a large main drawing room which inter-connects via double doors with the dining room and an Aga kitchen/breakfast room, family sitting room, utility and cloakroom.\n\nAt first floor level there are three en suite bedrooms including a principal with a dressing room and three further bedrooms and a family bathroom. This house benefits from two staircases and incorporates high levels of insulation, custom made joinery with double glazed Low E glass and beam and block construction to ground and first floors.\n\nOutside there is a pleasant garden surrounding the house and access into further gardens with a paddock beyond to the south. There is a detached double garage, built in identical style and standard to the house, which has been finished to include space for an office/recreation room. The garage block is 924 sq ft.\n\nIn all the gardens with the house are around an acre in size and the paddock around an acre and a half.\n\nIn all 2.49 acres including one acre of gardens.\n\nLocation\n\nThe Limes is situated along Park Road, a single track no through road on the outskirts of the attractive North West Essex village of Great Chesterford.\n\nThere are good facilities within the village including two public houses, two doctors surgeries and a hotel/restaurant, a repair garage and a well regarded primary school.\n\nMore comprehensive, shopping, recreational and cultural facilities are available in the nearby medieval market town of Saffron Walden approximately 4.75 miles to the south and the high tech University city of Cambridge is approximately 11.5 miles to the North.\n\nAs well as the school within the village there are independent schools in Saffron Walden and Cambridge.\n\nFor the commuter, there is ready access onto the M11 (Junction 9) leading to Stansted airport (junction 8), the M25 and London. Mainline rail services are available at Great Chesterford, Audley End and Whittlesford leading into Cambridge and London’s Liverpool Street stations.\n\nSquare Footage: 3,912 sq ft\n\n\nAcreage: 2.5 Acres\n\nDirections\n\nFrom London proceed north up the M11 to junction 9 taking the slip road down to the roundabout. Take the third exit towards Saffron Walden and proceed across the next two roundabouts signposted Saffron Walden. After approximately ¼ mile, turn left at Park Road and in about ½ mile’s distance, the property will be found on the left hand side behind a mature row of Lime trees.\nSERVICES\nMains water, electricity, private drainage to sewage treatment plant, oil fired central heating by radiators. Local area network. Pressurised oil fired central heating and hot water system.\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_20",
        "UUID": "13c6024d-f56d-4db7-b409-51f38f74512b",
        "Image": "https://media.rightmove.co.uk/10k/9527/128037308/9527_100539076668_IMG_01_0000.jpeg",
        "Price": "£1,800,000",
        "Address": "Hinton Way, Great Shelford",
        "Type": "Detached",
        "Description": "Property description\nPLANT ROOM wall mounted Vaillant gas fired boiler providing domestic hot water and central heating system, underwater heating controls, pressurised hot water cylinder, timber clocks, oak flooring. \n\nSHOWER ROOM fitted with white suite comprising low level w.c.,wall mounted wash hand basin, tiled shower cubicle, ceiling with inset downlighters, extractor fan, underfloor heating, stone tiled floor, double glazed sash window with shutters to the front. \n\nFOUR PANELLED TIMBER ENTRANCE DOOR with double glazed coloured glass leaded picture light above into: \n\nRECEPTION HALLWAY staircase rising to the upper floors with natural timber handrail, painted newel post and spindles with understairs storage cupboard and coats cupboard, tall ceilings with inset downlighters, architectural radiator, oak flooring. \n\nDRAWING ROOM with tall ceilings, moulded cornice, ceiling with inset downlighters, feature open fireplace with stone mantel and surround, slate hearth and slips, fitted cupboards and shelving to chimney breast recesses, oak flooring, deep moulded skirtings, double panelled radiator, sash bay window to the front with coloured and leaded quarterlights and shutters, twin sash windows to the rear with shutters. \n\nSITTING ROOM with tall ceilings, moulded cornicing, picture rail, feature open fireplace with stone mantel and surround, slate hearth, fitted cupboards and shelving to chimney breast recesses, double panelled radiator, oak flooring, deep moulded skirtings, twin sash windows to the front with coloured and leaded quarterlights and shutters. \n\nKITCHEN/BREAKFAST ROOM Kitchen has been fitted with a generous range of designer bespoke cabinetry with high quality Gagganhau appliances and incorporating a very special feature of floating central island with 5 ring Gagganhau gas hob with extractor hood above, further fitted appliances include electric fan oven, microwave combination oven, steam oven and a pair of warming drawers, fitted and concealed full height refrigerator, fitted and concealed three drawer freezer, pull-out larder, wine cooler, fitted and concealed dishwasher, stone tiled floor with recessed matwell, double glazed bi-fold doors to the side and rear, part vaulted ceiling with inset double glazed Velux rooflights and downlighters.  \n\nDOUBLE WIDTH UTILITY CUPBOARD plumbing and space for automatic washing machine, space for tumble dryer, storage shelving. \n\nLIVING/DINING ROOM feature tall ceilings, double glazed roof lanterns, inset downlighters, double glazed Velux rooflights, double glazed bi-fold doors to the rear, oak flooring, deep moulded skirtings, wall lights, underfloor heating. \n\nSTUDY/GROUND FLOOR BEDROOM ceiling with inset downlighters, deep moulded skirtings, oak flooring, underfloor heating, double glazed sash window with shutters to the front. \n\nON THE FIRST FLOOR  \n\nLANDING with staircase rising to the second floor, decorative moulded archway, tall ceilings with inset downlighters and picture rail, timber handrail, painted newel post and spindles, sash window to the front with leaded and coloured glass quarterlights and shutters, double panelled radiator. \n\nBEDROOM 1 tall ceilings, picture rail, cast iron fireplace, radiator, a pair of sash windows to the front with leaded and coloured glass quarterlights as well as shutters, oak flooring, radiator. \n\nENSUITE SHOWER ROOM with walk-in tiled shower with drencher shower head and glazed shower screen, wall mounted dual flush w.c., wash hand basin and mixer tap, storage drawer below, tiled floor with underfloor heating, heated towel rail/radiator, fitted shelving, fitted storage cupboard, downlighters, extractor fan, sash window to the rear. \n\nBEDROOM 2 tall ceilings, sash bay window to the front, coloured and leaded glass quarterlights and shutters, double panelled radiator, cast iron fireplace, wooden flooring, fitted wardrobe cupboards. \n\nBEDROOM 3 tall ceilings, inset downlighters, picture rail, cast iron fireplace, radiator, oak flooring, sash window to the rear, shutters. \n\nFAMILY BATHROOM comprising corner shower bath with curved glazed shower screen, drencher shower head and hand held rose, wall hung wash hand basin with storage drawer below, mixer tap, dual flush w.c., tiled floor with underfloor heating, part tiled walls, heated towel rail/radiator, ceiling with inset downlighters, extractor fan, a pair of sash windows to the rear. \n\nON THE SECOND FLOOR  \n\nSPACIOUS STUDY/LANDING storage cupboards, wood flooring, double panelled radiator, pair of double glazed sash windows to the front, and double glazed sash windows to the rear. \n\nSHOWER ROOM with walk-in tiled shower with glazed door, wash hand basin, storage cupboards, low level w.c., tiled floor, double panelled radiator, double glazed sash window to the rear, downlighters, extractor fan. \n\nBEDROOM 4 ceiling with inset downlighters, wood flooring, eaves storage cupboard, double panelled radiator, double glazed window to the rear. \n\nOUTSIDE The property sits comfortably within its own delightful generous plot. Vehicular gated access from Coppice Avenue via a pair of timber gates leading to an extensive gravelled driveway. DOUBLE GARAGE with timber doors to the front, power and light connected, panelled and glazed door to the rear and sash window to the rear, staircase rising to first floor storage loft with double glazed Velux rooflights.\n\nGenerous enclosed front garden with gravelled driveway, block paved seating area and pathway, ornamental pond, vegetable garden, mature hedgerow and front lawned area enclosed by close boarded timber fencing and hedging with a number of mature trees.\n\nEnclosed rear garden with paved patio area, raised timber deck with lighting, deep well stocked flowering and shrub beds, lawned area enclosed by close boarded timber fencing and hedging, timber storage shed,  \n\nMATERIAL INFORMATION Tenure - Freehold\nCouncil Tax Band - G \nBrochures\nOnline Glossy\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_21",
        "UUID": "e519f662-e2b5-473e-8834-f325c4371129",
        "Image": "https://media.rightmove.co.uk/35k/34529/128209700/34529_CAM200540_IMG_00_0000.jpeg",
        "Price": "£1,800,000",
        "Address": "Smiths End Lane, Barley, Royston, Hertfordshire",
        "Type": "Detached",
        "Description": "Property description\nA magnificent, 5 bedroom Grade II listed property with swimming pool and detached 2/3 bedroom dwelling, set within large gardens and grounds of 1.74 acres, including a 1 acre paddock.\n\nCambridge 13 miles, Saffron Walden 10 miles, Royston 4 miles (fast train to King's Cross) M11 (junction 10) 7 miles, Stansted Airport 18 miles (distances are approximate).\n\nGrade II listed, The Thatched Cottage is a quintessentially English, period property dating in part, from the 16th century. Constructed with a timber frame and re-fronted during the 20th century with weatherboard and red brick elevations under thatched and pantiled roofs, the current owners, have considerably extended and improved the property. The result is a quite outstanding and extremely versatile family home with beautifully presented, light and airy accommodation and a warm ambience throughout.\n\nThe Garden House\nIn addition to the main house, The Garden House provides a stunning, independent dwelling with well proportioned accommodation arranged over 2 floors which can be configured to provide 2 or 3 bedrooms as required. The Garden House shares utility services with the main house and also has access to an integral Garage 18’6 x 11’10 (5.63m x 3.61m) and garden with paved terrace adjacent to the rear elevation.\n\nBarley is an attractive North Hertfordshire village which enjoys a variety of facilities and amenities including primary school, doctors’ surgery, pharmacy, 2 public houses, church, shop/post office, village hall, scout troop, tennis club, cricket club, riding stables and recreation ground with children’s playground and tennis courts. Sitting within a conservation area, the property is located on Smiths End Lane, one of the best roads in the village and is adjacent to the cricket club. The market town of Royston is just 4 miles to the west and provides a more extensive range of shopping facilities, schools catering for all ages and an 18-hole golf course.\n\nThe University City of Cambridge lies approximately 13 miles to the north and is not only world renowned for its academic achievements, but also, as the centre of the ‘high tech’ and ‘bio-tech’ industries with the University Research and Development Laboratories, the internationally renowned Cambridge Science Park and Addenbrooke’s Hospital/Biomedical Campus. There is also an excellent choice of independent schools on the south and west side of the city.\n\nFor the commuter, there is a mainline railway station at Royston providing a fast service to London’s King’s Cross in about 38 minutes or alternatively, Audley End Station is about 9 miles to the east providing services to Liverpool Street in about 60 minutes. The M11 (junction 10) is about 7 miles to the east, providing access to Stansted Airport and the M25. Alternatively, Luton Airport is within approximately 32 miles.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_22",
        "UUID": "861fe583-9665-43a7-84e7-46c357f79a45",
        "Image": "https://media.rightmove.co.uk/51k/50428/127516682/50428_FCY220122_IMG_00_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Mill Lane, Hemingford Grey, Huntingdon, Cambridgeshire, PE28",
        "Type": "Detached",
        "Description": "Property description\nLocated in one of Cambridgeshire's most sought after villages on a very private plot, The Chestnuts has been extended, improved, and offers over 5800 square feet of beautifully presented accommodation.\n\nDouble doors from the entrance hall open onto two of the three reception rooms and the stunning kitchen dining family room. The large living room with feature fireplace has double doors leading into the games room allowing a more open plan feel if required. The generous snug is very flexible and could be used as a formal dining room or large work from home office. It has double doors to the front and together with the two Velux windows floods the room with natural light. The open plan kitchen family dining room is fitted with a range of modern units, a Rangemaster cooker, integrated appliances and quartz worksurfaces. Bi-fold doors open onto the west facing garden terrace blending the outside and inside seamlessly. A large utility, fitted with secondary kitchen, offers practicality and is ideal for families and muddy boots! The indoor pool room, with vaulted ceiling and bi-fold doors, also boasts a hot tub and changing/shower room facilities.\n\nOn the first floor there are five bedrooms; the very large principal bedroom has a luxurious en-suite bathroom with free standing bath and separate shower. Bedroom two also has an en-suite - perfect as a guest suite. Bedrooms three, four and five are served by the large family bathroom with free standing bath and separate shower. The second floor is ideal for numerous uses such as accommodation for an au pair or for older, independent children and comprises a sitting area and a large en-suite bedroom.\n\nThe rear garden is mature with a range of trees ensuring privacy, a raised paved terrace with ample room for seating and dining areas and a mature lawn. The plot is very private from the road having double electric gates opening onto a large front garden with gravel drive, parking area, raised borders and a separate children’s play area.\n\nSeller Insight\n\n“I wanted to move to the village as my family live here and this particular property appealed to me as I like a project and I saw it as a great opportunity. The position of the property within the village was also a big attraction as it’s central but very quiet with open fields to the front. I also happen to think that it’s the loveliest lane in the Hemingfords,” says the owner.\n\n“I bought the property in 2017 and the renovations were completed two years ago. It was an absolutely huge project, the biggest I’ve ever done, and I had to move out for 6 months whilst some of the work took place. Originally a 1960s four-bedroom house, it’s been completely refurbished and extended out in all directions. The frontage is now wonderfully characterful with two gables and painted black and white. It was a long haul and I’m very pleased with the result.”\n\n“Hemingford Grey is a lovely place to live with footpaths all around and scenic river walks to enjoy. We have a brilliant shop, award winning pub, coffee shop, primary school, sports and social club, and plenty of groups and activities to get involved in. It’s an easy walk or cycle into St Ives and it’s less than 10 minutes to Huntingdon station with regular fast trains into London. It’s a fantastic village in a perfect location and everything is easily accessible.”\n\n“The front garden is set back behind security gates, so it’s private and safe for everyone. There’s plenty of parking available and play areas for children to enjoy. The rear garden is low maintenance and totally secluded, so it’s ideal for pool parties, relaxing, and entertaining. Bifold doors open to the back garden, so we all spill outside when the weather is good.”\n\n“I tend to spend most of my time in the light and airy kitchen as it’s perfect for dining and chatting on the comfortable sofas. The principal bedroom is my haven of tranquillity and I use the indoor swimming pool every morning. It’s made such a difference to my fitness. The Chestnuts is a brilliant entertaining house where we’ve enjoyed regular family get-togethers to celebrate birthdays and other events, including Why not, it’s Friday! We unwind in the spa, play pool in the games room, and relax together in the peace and quiet of the living room.”\n\nVillage information\n\nThe Hemingfords (Abbots and Grey) are situated along the banks of the River Great Ouse and are well-known as very picturesque and sought-after Cambridgeshire villages. Much of the villages are in a Conservation Area with many thatched cottages and barns and other architecturally important buildings such as the Grade I listed church with its towering spire being a landmark for miles around.\n\nThe combined villages have excellent facilities: across the road from the “Axe & Compass” pub in Hemingford Abbots is the purpose-built village hall and playing field. The playing field, with open grassland, is equipped with modern children’s play equipment while neighbouring Hemingford Grey has a village shop, post office, primary school, sports pitches, children’s play areas and the award winning “Cock” pub. Between the two villages there are a variety of clubs, societies and activities such as the annual Regatta and biennial Flower Festival.\n\nTransport\n\nThe Hemingfords sit between the towns of Huntingdon and St Ives where a wider selection of shops, restaurants and leisure facilities are available. The newly modified A14 provides quick and easy access into Cambridge and links to the A1, M11 and the national motorway network. Huntingdon has a railway station, about 10 minutes’ drive away, with fast trains into London King’s Cross in approx. 50 minutes and links to the North via Peterborough whilst St Ives offers the Guided Busway service to the Cambridge Science Park and city centre.\n\nSchools\n\nThere is a good selection of primary schools within 1-1.5 miles including: Hemingford Grey Primary. There are also several well-regarded secondary schools in the neighbouring towns such as Hinchingbrooke school in Huntingdon and St Ivo Academy in St Ives. Independent schools in Cambridge and Kimbolton are also within easy reach.\n\nAgents Information\n\nTenure: Freehold\nYear Built: 1960s\nEPC: D\nLocal Authority: Huntingdon District Council\nCouncil Tax Band: F\n\nIMPORTANT NOTE TO PURCHASERS:\nWe endeavour to make our sales particulars accurate and reliable, however, they do not constitute or form part of an offer or any contract and none is to be relied upon as statements of representation or fact. Any services, systems and appliances listed in this specification have not been tested by us and no guarantee as to their operating ability or efficiency is given. All measurements have been taken as a guide to prospective buyers only, and are not precise. Please be advised that some of the particulars may be awaiting vendor approval. If you require clarification or further information on any points, please contact us, especially if you are traveling some distance to view. Fixtures and fittings other than those mentioned are to be agreed with the seller.\n\nFCY220122\nBrochures\nWeb Details\nFull Brochure PDF\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_23",
        "UUID": "683b8a1d-5d43-40cd-8ce2-886582cf17c6",
        "Image": "https://media.rightmove.co.uk/177k/176441/85427217/176441_31545954_IMG_00_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Headley Gardens, Great Shelford, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nA substantial stylish and elegant detached family residence offering generously proportioned and beautifully presented accommodation of about 3400 sqft, set within mature and private gardens and grounds, and boasting one of Great Shelford’s premier addresses\n\nThis superb individual detached modern family residence was constructed in the summer of 2002 by the well-known and highly regarded local developer David Reed Homes Ltd, to a generously proportioned and well-planned design. The property is ideal for the largest of families with accommodation extending to about 3400 sqft, and all finished to exacting standards throughout. The accommodation comprises a large welcoming reception hall with stairs to first floor, solid oak flooring with a coat and shoe room, plus cloakroom WC just off. There are three generous reception rooms including a large sitting room with doors to the garden and boasting a feature open fireplace, dining/family room and a bay windowed office/playroom. The heart of this wonderful home and certainly worthy of note is the open plan kitchen/breakfast room. This is an excellent entertaining space and fitted with designer cabinetry, stone composite work surfaces with matching central preparation island incorporating a De Dietrich induction hob with counter mounted retractable extractor hood, integrated knife block and kitchen scales, plus a teppanyaki grill. The wall cabinetry incorporates a twin oven, microwave, plate warmer and espresso maker, dishwasher and space for an American style fridge/freezer, plus a walk-in pantry cupboard. Just off the kitchen is a handy utility room with fitted storage cupboards, wall mounted gas fired central heating boiler, door to garden and door to the garage.\n\nUpstairs, off the galleried landing are six bedrooms including the master bedroom with luxury en suite facilities, and guest bedroom with en suite shower room. There is also a large bedroom (3) which has in the past been utilised as a hobby room over the garage\n\nOutside, the property is set back from the road and screened by hedging. A generous block paved driveway provides parking for several vehicles and leads to the double garage with two up and over doors (one electrically operated) with power and light connected and incorporating a gardener wc. The front garden has been landscaped with gravelled pathways between shaped flower and shrub beds, a selection of trees and mature hedging. Gated access leads to the rear garden which again has been professionally landscaped, a generous and private space laid mainly to shaped and manicured lawns with well stocked flower and shrub borders and beds. There is an expansive paved terrace, ideal for al fresco dining or summer evening entertaining, and all complimented by hard landscaping with water feature and feature circular patio enclosed by neat box hedging. The gardens and grounds extend to about 0.3 acres and enjoy excellent levels of privacy.\n\nLocation - Great Shelford is a well regarded village just south of Cambridge, offering an excellent range of local amenities including shops, banks, building society, restaurants, bakers, delicatessen, library and butchers. There is also a sought after primary school, health centre, dentist and great sporting facilities within the recreation ground. The village is ideally placed for access to both Cambridge and London with excellent road connections, local bus services and a mainline railway station with trains from Cambridge to London Liverpool Street. Addenbrookes Hospital is only around 2 miles away and Cambridge City centre about 4 miles away.\n\nServices - All mains services connected\n\nStatutory Authorities - South Cambridgeshire District Council\n\nFixtures And Fittings - Unless specifically mentioned in these particulars all fixtures and fittings are expressly excluded from the sale of the freehold interest.\n\nViewing - Strictly by appointment through the vendor’s sole agents, Redmayne Arnold and Harris\n\nBrochures\nHeadley Gardens, Great Shelford, Cambridge\nBrochure\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_24",
        "UUID": "08fc8184-04be-4fec-aca9-76cb8c119f2b",
        "Image": "https://media.rightmove.co.uk/212k/211991/126854648/211991_CNH220006_IMG_15_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Chalk Glade, Cambridge, CB1",
        "Type": "Detached",
        "Description": "Property description\n** SHOW HOME OPEN **\n- CALL NOW TO ARRANGE YOUR APPOINTMENT\n\n\n\nCHALK GLADE, QUEEN EDITHS WAY\n\n\n\nA new development of 4 luxury detached four bedroom family homes with private gardens\n\n\nPlot 4\n\nPlot 4 is an individually designed two storey home. To the ground floor is an impressive entrance hall with engineered oak flooring. The principle bedroom benefits from dressing area, fitted wardrobes and an en-suite. Two further bedrooms with fitted wardrobes to bedroom 2, plus a further family bathroom. There is also a dedicated utility room with sink, washing machine and dryer.\n\nThe staircase to the first floor features oak handrail and glass balustrades, and leads to a stunning open-plan living space with impressive high ceilings, bio-ethnol fireplace and Velfac sliding doors onto the rear garden. The kitchen has been designed by a local company, and benefits from stone worktops and integrated appliances to include wine cooler and Quooker tap. There is also a further double bedroom with en-suite to the first floor, ideal for a guest room or home office.\n\nOutside, there is private parking and landscaped front garden, with a staircase providing access to the rear garden which has a generous porcelain tile patio.\n\nChalk Glade\nArguably the finest collection of houses built in Cambridge recently, this prestigious development of just 4 four-bedroom detached family homes is located on Queen Ediths Way.\nOffering excellent access to Addenbrookes, ARM, railway station and some of the top private schools in the UK, this private residence epitomises family living.\nThe homes at Chalk Glade boast modern architecture with elegant interiors and incomparable features. Designed and executed by Yellow Tomato Homes, a small independent and local developer who have raised the bar for the future of Cambridge developments.\n\nLocation\nQueen Ediths Way is a popular residential area approximately 3 miles south-east of the city centre. It’s close proximity to Addenbrookes Hospital & Biomedical Campus, ARM and schools including The Perse Pellican, The Leys, Queen Ediths and Queen Emma amongst others make it popular with families.\n\nThere are many social amenities nearby including Netherhall Sports Centre, Gog Magog Golf Club and Cherry Hinton Park, as well as convenience stores, library, bakery and medical centre.\n\nQueen Ediths Way offers excellent access to the A11, A14 and Cambridge Railway Station, as well as being on a main bus route into the city centre.\n\n\nYellow Tomato Homes Ltd.\nYellow Tomato Homes is a local, privately funded property development business with an emphasis on the development of small to medium sized sites, delivering high quality, architecturally designed, superior homes in prestige locations.\nWith a base close to Cambridge, YTH work across Cambridgeshire, Norfolk, Suffolk, Essex and Hertfordshire, identifying sites in prime locations and working tirelessly to deliver homes which are as unique and special as the places they will come to occupy.\nWith a core of experienced and trusted tradespeople, and a wider network of specialist contractors, suppliers, advisors and professionals, Yellow Tomato Homes are proud to deliver quality homes with an outstanding finish to give homeowners a place to be proud to call home.\nThe high standards of design, materials and construction are as important as they are to those who then live in the houses they deliver.\n\n\nDisclaimer – The images shown are for illustrative purposes only, are not plot specific and may vary from finishes within individual properties. The information given is without responsibility on the part of the agent (sellers) and you should not rely on the information being factually accurate about the property. Neither Carter Jonas LLP nor anyone in its employment or acting on its behalf have the authority to make any representation or warranty in relation to this property. The areas, measurements and distances are approximate only.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_25",
        "UUID": "01b571b0-e0ce-426b-b4b2-4912d447340c",
        "Image": "https://media.rightmove.co.uk/30k/29201/84681946/29201_29996461_IMG_15_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Whittlesford, Cambridge - CIRCA 13 ACRE BURIAL GROUND",
        "Type": "Land",
        "Description": "Property description\nSituated just seven miles south of Cambridge, an EXTREMELY RARE circa 13 acre BURIAL GROUND having consent for 3,318 plots (some double) with grave markers/headstones, including 404 green burial plots, single storey Remembrance Hall of approximately 3,000 sq ft , parking and wooded areas.\n\nCentrally located in a high conurbation area, this unblemished site is ideal for private, mainstream or corporate operators or as a private faith ground. Located on the outskirts of the village, there is a house on the site which is to be demolished as a condition of the Planning Consent - Appeal Ref No. APP/W0530/W/19/3242655.\n\nThere are three monitored boreholes on the land.\n\nTenure - Freehold\n\nBrochures\nSpinney Hill Farm web brochure.pdf\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_26",
        "UUID": "7c5069d0-3328-40f3-87aa-8a2fa7c57364",
        "Image": "https://media.rightmove.co.uk/48k/47865/126567920/47865_NCA220283_IMG_18_0001.jpeg",
        "Price": "£1,750,000",
        "Address": "The Mazles, The Birdlings, Comberton, Cambridge, Cambridgeshire",
        "Type": "Detached",
        "Description": "Property description\nTHE ASPEN AT THE BIRDLINGS\n\n\n** READY TO MOVE INTO! **\n\nA stunning 5 bedroom detached family home in this prime west Cambridge village.\n\nThis popular village is very well served with a convenience store, post office and excellent schools - nursery, primary and the highly regarded Comberton Village College.\n\nThe Aspen has been finished to an exceptional standard, and includes:\n\n* Contemporary kitchens with Silestone worktops and upstands, the utility room has the matching finishes.\n\n* Miele appliances of steam oven, down drafter induction hob, 2 x single oven, combi microwave/oven.\n\n* Free standing Fisher Paykel fridge freezer.\n\n* Air source heat pump providing the heat and hot water\n\n* Underfloor heating to the ground floor with radiators to the first\n\n* Wood burner fitted in the living room\n\n* Main bedroom with walk through dressing area and stylish en suite shower room\n\n* Two further en suites and a family bathroom\n\n* Sanitary ware from Duravit with Hansgrohe taps and showers\n\n* Landscaping to front and rear gardens with attractive paved patios\n\n\nAll homes at The Birdlings benefit from a 10 year LABC warranty and undergo a detailed Quality Control process before handover, followed with a further 12 months final inspection.\n\nThese homes are within the final collection at The Birdlings, with the further plots available being ready for completion towards the end of 2022 into early 2023.\n\n* Flooring throughout - a combination of Karndean, carpet and large format Porcelanosa tiling\n\n* Electric up and over garage door in a walnut finish\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_27",
        "UUID": "9f905eb7-c952-44f5-8260-7b1afe490196",
        "Image": "https://media.rightmove.co.uk/203k/202805/127992602/202805_31865743_IMG_00_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Almoners Avenue, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nFinal property remaining on this exclusive development of just two high-end homes. A rare opportunity to acquire one of a pair of brand-new substantial detached contemporary properties situated in this most sought-after location just off Hills Road and close to Addenbrookes Hospital and Biomedical Campus. These high specification homes are being built to exacting standards offering contemporary living for the most discerning of buyers. Each property enjoys a tucked away setting with landscaped gardens. Call now to arrange an early viewing. Completion anticipated towards the end of 2022.\n\nThis rarely available and individual development of just two high-end contemporary detached homes is nestled in an established setting at the end of the highly sought after Almoners Avenue on a private drive, just off Hills Road. Located on the south side of the City, the properties form part of a popular residential area and are well placed for access to Addenbrooke’s Hospital and Biomedical Campus.\n\nEach home offers exceptional space and flexibility with bright, well-planned accommodation set across two floors, with large glazed doors opening to a generous terrace and secluded garden. Built to exacting standards, with high specification fittings, the homes each boast an impressive central kitchen/dining/family room with luxury fitted kitchen, Quartz work surfaces and Mielie integrated appliances, with feature vaulted ceiling and gallery above.\n\nEach home will also benefit from a double carport with living roof, landscaped enclosed rear gardens and a 10 year warranty.\n\nPlot 2 is the only plot remaining on this exclusive development. Call now to discuss in more detail. Completion anticipated towards the end of 2022.\n\n*Please note that CGI's are for illustrative purposes only. Architects plans shown and any dimensions given may differ from the final as-built properties. Photos shown are of Plot 1 which is a handed property to Plot 2*\n\nKitchen Fittings - oContemporary kitchen\noQuartz work surfaces and matching up stands\noNovy Panorama Induction Hob\noLED Unit and Centre Island Lights\noStainless Steel Blanco sink\noIntegrated Miele appliances Oven, Combi Microwave, Warming Drawer, Fridge, Freezer, Dishwasher\noUnder Counter Wine Cooler\noPre-wired for streamed audio\n\nUtility Room - oContemporary kitchen\noStainless steel Blanco sink\noPlumbing and space for washing machine and separate tumble drier\noHigh efficiency Vaillant Ecotec plus boiler\n\nHeating And Water System - oHigh efficiency Vaillant Ecotec plus boiler\noUnderfloor heating to ground floor with independent zoned thermostat’s\noRadiators to first floor\noHigh capacity 300L pressurised hot water cylinders with electric immersion heater\noOutside tap\n\nBathrooms, En Suites And Cloakrooms - oContemporary white Duravit sanitaryware\noHansgrohe chrome mixer taps and shower fittings\noCrosswater Dual Control Bar shower\noVerde Bath (main bathroom only)\noDuravit Vanity units with wash basin over\noSoft Close toilet seats\noHeated Ambience LED Mirrors\noHeated chrome towel rails\noHeated Floors\noTiled floor and walls\n\nElectrical - oData wiring system\noIntruder alarm\noTelevision points to all reception rooms and bedrooms\noData points to all reception rooms and bedrooms\noPre-wired for Streamed Audio\noLED down lighters throughout\noExternal lights to front, side and rear\noExternal waterproof double power socket\noWired smoke alarms\noElectric car charging point\n\nConstruction And External Finishes - oHigh quality facing brickwork\noSlate tiled roof\noZinc Fascia, Guttering and Downpipes\noHigh specification Aluminium double-glazed windows and doors\noAluminium Bi-fold doors to Living room\noChrome/Glass Juliette Balconies\noBrick double garage with Sedum Roof and Electric charging points\n\nInternal Finishes - oContemporary style internal doors\noVenti Lever Satin Nickel Ironmongery\noBespoke Oak/Glass staircase\noDividing doors to Living room\no100L log burning stove to Living Room room\n\nFlooring - oFitted floor throughout\noTiled floors to bath and shower rooms\n\nProperty Details - oWarranty: 10 year One Guarantee warranty\noTenure: Freehold\noServices: All mains services are connected to the property.\noLocal Authority\noSouth Cambridgeshire District Council.\noUnless specifically mentioned in these particulars all fixtures and fittings are expressly excluded from the sale of the freehold interest.\n\nServices - All mains services connected\n\nStatutory Authorities - Cambridge City Council\n\nFixtures And Fittings - Unless specifically mentioned in these particulars all fixtures and fittings are expressly excluded from the sale of the freehold interest.\n\nViewing - Strictly by appointment through the vendor’s sole agents, Redmayne Arnold and Harris\n\nBrochures\nAlmoners Avenue, Cambridge\nBrochure\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_28",
        "UUID": "0b948a16-5df7-4559-8c9b-7389ebf5a9d9",
        "Image": "https://media.rightmove.co.uk/15k/14135/128467388/14135_CAH220329_IMG_19_0000.jpeg",
        "Price": "£1,750,000",
        "Address": "Glebe Close, Cambridge, CB1",
        "Type": "Semi-Detached",
        "Description": "Property description\nStunning, contemporary, semi-detached home with over 2,472sqft of superbly presented accommodation situated in private mews of just five properties. With garage & parking for three cars, covered bicycle storage and low maintenance, south-facing landscaped gardens with wonderful outlooks.\n\n- City Centre - approx. 1.5 miles\n- Railway Station - approx. 1 mile\n- Addenbrookes Hospital - approx. 0.5 miles\n\n• Reception hall\n• Sitting room\n• Kitchen/breakfast diner\n• Study/bedroom 5\n• Ground floor bathroom\n• Utility\n• Principal bedroom with en-suite & dressing room\n• Bedroom 2 with en-suite and dressing area\n• 2 Further bedrooms with ‘Jack & Jill’ bathroom\n• Integral garage & workshop\n• Parking, secure covered bicycle & bin store\n• Rear garden with terrace & potting shed\n• Balcony\n• EPC rating A\n\nThe Property\nDesigned by award winning Cambridge based architect, this superb property was designed with low energy and sustainability at its core. Underfloor heating to ground and first floors with radiators on the top floor. High performance double glazing throughout which provides a high level of insulation and quiet.\n\nSince purchasing the property around 5 years ago, the current owners have added their own touches to create a wonderfully stylish and individual city home. The versatile and spacious accommodation is full of natural light with a emphasis on convenient, modern living, ideal for families and entertaining.\n\nThe wide reception hall opens through to the large sitting room with double doors opening to the bespoke kitchen/diner, both with bi-fold doors to the terrace and garden. The study/potential fifth bedroom and beautiful bathroom on this floor again highlight the flexibility of the property. The kitchen is fully fitted with a central island with breakfast bar. There is a utility room with plenty of storage which in turn leads through the garage and workshop.\n\nOn the first floor are two bedrooms including dressing areas and en-suite bathrooms. The second floor offers two more double bedrooms, one with a balcony, and a fourth bathroom, accessible to both bedrooms. There is underfloor heating to ground and first floor with radiators on the top floor and double glazing throughout providing high levels of insulation and quiet.\n\nViewing of this fantastic and aspirational home is highly recommended.\n\nOutside\nThe property is approached over a shared driveway leading to the allocated parking for the house and a garage, with up and over door. To the side of the house is an area of hardstanding with secure gate opening to the covered storage area/shed for bicycles, bins etc. The rear gardens are very pleasantly landscaped with low maintenance in mind. Along the back of the house are paved terraces, with timber pergolas over, ideal for al-fresco dining etc. There is a lovely potting shed in one corner as well as a gate opening to the allotments behind - No 5 and one other resident in the Close share an allotment.\n\nLocation\nGlebe Close is a quiet private mews of just five properties situated off Glebe Road in one of the city’s most favoured residential locations. It is ideally located for access to Addenbrookes Hospital, the city centre, the railway station and guided bus route. It is also within walking/cycling for many of the renowned schools and colleges providing schooling for all ages. There is a regular bus service within walking distance as well as a dedicated cycle path. There is also easy access to major road networks including the M11, A14 and A11. Local and recreational shopping amenities are available on Cherry Hinton Road including a pharmacy, wine bar and café/deli as well as the Leisure Park along with a Waitrose supermarket in Trumpington. There is also a local library on nearby Rock Road.\n\nAdditional Information:\n\nTenure: Freehold\n\nServices: Mains water, electricity and drainage. Gas fired central heating. Solar panels to supplement energy source.\n\nLocal Authority: Cambridge City Council\n\nCouncil Tax: Band G\n\nViewings: Strictly by appointment with the selling agents Carter Jonas\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_29",
        "UUID": "a7defdc2-eb75-4799-9d2c-a29920c2b2bb",
        "Image": "https://media.rightmove.co.uk/3k/2105/126272681/2105_RYN108370_IMG_00_0000.jpeg",
        "Price": "£1,700,000",
        "Address": "St Neots Road, Dry Drayton, Cambridge",
        "Type": "Detached",
        "Description": "Property description\n\nSUMMARY\nAn opportunity to purchase this stunning and rarely available six/seven bedroom detached family home which has been finished to a high specification with grounds extending to roughly 4,300 square feet. Early internal viewing is recommended at the earliest opportunity to avoid disappointment.\n\n\nDESCRIPTION\nSituated in a quiet residential location, an opportunity to purchase this stunning and rarely available six/seven bedroom detached family home which has been finished to a high specification. Accommodation also includes lounge, open plan kitchen/family/dining room, utility room and double garage. To the outside, there are large gardens to front and rear with grounds extending to roughly 0.65 acres.\n\nDry Drayton is an attractive and sought-after South Cambridgeshire village with Village Hall, Church, Primary School and Inn all located within the village. The village is also conveniently located 5 miles west of the city of Cambridge and is within easy access of the A14.\n\nCovered Entrance \nSecurity light. Triple glazed front doors to entrance hall.\n\nEntrance Hall \nLED lighting. Entrance hall with Tiled floor, Under-floor heating and Staircase to first floor landing.\n\nKitchen/ Dining/ Family Room 34' max x 30' 2\" max ( 10.36m max x 9.19m max )\nBeautiful fitted kitchen comprising Electric fan oven and Hob with extractor over and LED downlighters, Combination microwave oven, Warming drawer, Coffee machine, American-style concealed full height Refrigerator and Freezers, Dishwasher, Wine cooler. One-and-a-half bowl sink with mixer taps and stone working surface surrounds. Excellent range of base and wall units, Central island with stone top and storage cupboards below, Breakfast bar. Full width triple glazed bi-fold doors to rear garden. Tiled flooring with under-floor heating. TV point.\n\nUtility  18' 6\" x 5' 6\" ( 5.64m x 1.68m )\nLED lighting. Triple glazed doors to front and rear. Sink with mixer taps and stone work surface surrounds. Plumbing for automatic Washing machine, Space for tumble dryer, Storage cupboards, Tiled flooring. Personal door to:\n\nDouble Garage \nDouble garage with remote control up-and-over door, triple glazed windows to rear.\n\nLounge 26' x 18' 5\" ( 7.92m x 5.61m )\nLED lighting. Carpeted flooring, Wall-mounted electric fire, TV point, Triple glazed window to side. Triple glazed bi-fold doors to rear garden.\n\nBathroom \nModern suite comprising double-ended Bath with Shower attachment over, Low-level dual flush WC, Wash hand basin set into vanity unit, Heated mirror with motion sensor, Cupboard housing pressurised hot water cylinder, Under-floor heating. Radiator. LED lighting.\n\nBedroom One 15' 6\" x 12' 6\" ( 4.72m x 3.81m )\nLED lighting, TV point, Under-floor heating, Fitted double wardrobe, Triple-glazed window.\n\nBathroom \nFour-piece suite comprising Walk-in shower cubicle, Bath with mixer taps and shower attachment over, Low-flush WC, Wash hand basin set into Mirror-fronted cabinet with shaver point. Tiled flooring. Under-floor heating. Extractor fan.\n\nBedroom Two 15' 6\" x 12' 6\" ( 4.72m x 3.81m )\nLED lighting, TV point, Under-floor heating. Triple glazed windows to front and side.\n\nEn-Suite \nEn-suite shower room comprising Tiled shower cubicle, Low-level dual flush WC, Wash hand basin set into vanity unit, Radiator, Tiled walls and floor, Under-floor heating, Heated towel rail. Triple glazed frosted window to side.\n\nGym 12' 7\" x 17' 7\" ( 3.84m x 5.36m )\nEngineered oak floor & underfloor heating. Triple glazed windows to front and side.\n\nStaircase To First Floor \nStaircase from entrance hall to first floor landing.\n\nFirst Floor Landing \nGlass balustrades, Radiator, Large storage cupboards, one housing wall-mounted gas boiler. Triple glazed window to rear.\n\nMaster Bedroom 20' x 11' 6\" ( 6.10m x 3.51m )\nPart-vaulted ceiling, TV point, Double wardrobes, Triple glazed bi-fold doors to balcony. Radiator.\n\nEn-Suite \nFour-piece suite comprising Panelled enclosed Bath, Separate tiled Shower cubicle, Low-level dual flush WC, Wall-hung double wash hand basin set into vanity unit with cupboards below, Heated mirror, motion-controlled light, Shaver point, LED lighting, Radiator, Extractor fan, Triple glazed window to front.\n\nStudy/ Bedroom Four 9' 6\" x 6' 9\" ( 2.90m x 2.06m )\nLED lighting, Extractor fan, Triple glazed window to front.\n\nBedroom Five 17' 7\" x 15' 2\" Plus dressing area ( 5.36m x 4.62m Plus dressing area )\nDouble wardrobes to one wall, LED lighting, Double radiators, Triple glazed velux rooflight. Triple glazed bi-fold doors to rear with Juliet balcony.\n\nEn-Suite \nFive piece suite comprising Double-ended Bath, Walk-in tiled Shower cubicle, Two wash-hand basins set into vanity unit with cupboards below, Wall-mounted mirror with Lighting and Bluetooth Speaker,Radiator, Tiled flooring, Part-tiled walls, LED lighting, Extractor fan, Triple glazed window to side.\n\nBedroom Six 17' 8\" x 16' 3\" ( 5.38m x 4.95m )\nTwo fitted double wardrobes to one wall, Two radiators, TV point, Velux rooflight Triple glazed window to front.\n\nEn-Suite \nSuite comprising Bath, Tiled Shower cubicle, Two wash hand basins set into vanity unit with cupboards below, LED lighting, Tiled flooring, Extractor fan, Triple glazed window to side.\n\nBedroom Seven 10' 7\" x 9' 4\" ( 3.23m x 2.84m )\nTriple glazed velux rooflight, Radiator, Access to Loft.\n\nOutside \nThe property sits on a large plot with grounds extending to roughly 0.6 acres with gardens to front and rear both primarily laid to lawn.\n\nFront Garden \nElectric gate leading to large front garden with Paved driveway leading to double garage providing off-street parking for a number of vehicles. Lawned area.\n\nRear Garden \nSpacious rear garden with Porcelain tiled patio leading to lawned area with fence surrounds.\n\nAgent's Note \nThe property benefits from a 24/hr CCTV system with cameras located in various positions around the property. Also included with the property is a 10kw solar panel system providing electricity to the property.\n\n\n\n1. MONEY LAUNDERING REGULATIONS: Intending purchasers will be asked to produce identification documentation at a later stage and we would ask for your co-operation in order that there will be no delay in agreeing the sale.\n2. General: While we endeavour to make our sales particulars fair, accurate and reliable, they are only a general guide to the property and, accordingly, if there is any point which is of particular importance to you, please contact the office and we will be pleased to check the position for you, especially if you are contemplating travelling some distance to view the property.\n3. The measurements indicated are supplied for guidance only and as such must be considered incorrect.\n4. Services: Please note we have not tested the services or any of the equipment or appliances in this property, accordingly we strongly advise prospective buyers to commission their own survey or service reports before finalising their offer to purchase.\n5. THESE PARTICULARS ARE ISSUED IN GOOD FAITH BUT DO NOT CONSTITUTE REPRESENTATIONS OF FACT OR FORM PART OF ANY OFFER OR CONTRACT. THE MATTERS REFERRED TO IN THESE PARTICULARS SHOULD BE INDEPENDENTLY VERIFIED BY PROSPECTIVE BUYERS OR TENANTS. NEITHER SEQUENCE (UK) LIMITED NOR ANY OF ITS EMPLOYEES OR AGENTS HAS ANY AUTHORITY TO MAKE OR GIVE ANY REPRESENTATION OR WARRANTY WHATEVER IN RELATION TO THIS PROPERTY.\nBrochures\nPDF Property Particulars\nFull Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_30",
        "UUID": "22c05c3c-8a22-4d8e-894c-b3099764c083",
        "Image": "https://media.rightmove.co.uk/212k/211991/126641144/211991_CNH220003_IMG_27_0000.jpeg",
        "Price": "£1,695,000",
        "Address": "Chalk Glade, Cambridge, CB1",
        "Type": "Detached",
        "Description": "Property description\nBRAND NEW EXCLUSIVE DEVELOPMENT\n\n\n\n** SHOW HOME OPEN **\n- CALL NOW TO ARRANGE YOUR VIEWING\n\n\n\nA new development of 4 luxury detached four bedroom family homes with private gardens\n\n\n\nPlot 1\nPlot 1 is an impressive three storey home, boasting just under 3000sqft of accommodation which includes a 550sqft integral garage with electric up and over door, tiled flooring and underfloor heating. Upon entering this home, you will find a generous entrance hall with oak engineered flooring, double bedroom with en-suite, and dedicated utility room with sink, washing machine and tumble dryer.\n\nThe staircase to the first-floor features oak handrail and glass balustrades, and leads to a well-designed open-plan kitchen/dining room, with separate living room featuring bio-ethanol fireplace and sliding doors onto garden. The kitchen has been designed and installed by a local company, and benefits from stone worktops and integrated appliances to include American style fridge/freezer, wine cooler, two slide and hide ovens, eye level microwave, ceramic and gas hob and multi-function tap. With ample natural light encouraged by the floor to ceiling windows and huge skylight, this truly is a hidden gem. There is also a further double bedroom with en-suite to the first floor, ideal for a guest room.\n\nTo the second floor is a further double bedroom and master-bedroom with en-suite and fitted wardrobes, plus shower room.\n\nOutside, there is private parking and landscaped garden, with a staircase providing access to the rear garden which has a generous porcelain tiled patio.\n\n\nChalk Glade\nArguably the finest collection of houses built in Cambridge recently, this prestigious development of just 4 four-bedroom detached family homes is located on Queen Ediths Way.\nOffering excellent access to Addenbrookes, Biomedical Campus, ARM, railway station and some of the top private schools in the UK, this private residence epitomises family living.\nThe homes at Chalk Glade boast modern architecture with elegant interiors and incomparable features. Designed and executed by Yellow Tomato Homes, a small independent and local developer who have raised the bar for the future of Cambridge developments.\n\n\nLocation\nQueen Ediths Way is a popular residential area approximately 3 miles south-east of the city centre. It’s close proximity to Addenbrookes Hospital & Biomedical Campus, ARM and schools including The Perse Pellican, The Leys, Queen Ediths and Queen Emma amongst others make it popular with families.\n\nThere are many social amenities nearby including Netherhall Sports Centre, Gog Magog Golf Club and Cherry Hinton Park, as well as convenience stores, library, bakery and medical centre.\n\nQueen Ediths Way offers excellent access to the A11, A14 and Cambridge Railway Station, as well as being on a main bus route into the city centre.\n\n\nYellow Tomato Homes Ltd.\nYellow Tomato Homes is a local, privately funded property development business with an emphasis on the development of small to medium sized sites, delivering high quality, architecturally designed, superior homes in prestige locations.\nWith a base close to Cambridge, YTH work across Cambridgeshire, Norfolk, Suffolk, Essex and Hertfordshire, identifying sites in prime locations and working tirelessly to deliver homes which are as unique and special as the places they will come to occupy.\nWith a core of experienced and trusted tradespeople, and a wider network of specialist contractors, suppliers, advisors and professionals, Yellow Tomato Homes are proud to deliver quality homes with an outstanding finish to give homeowners a place to be proud to call home.\nThe high standards of design, materials and construction are as important as they are to those who then live in the houses they deliver.\n\n\nDisclaimer – The images shown are for illustrative purposes only, are not plot specific and may vary from finishes within individual properties. The information given is without responsibility on the part of the agent (sellers) and you should not rely on the information being factually accurate about the property. Neither Carter Jonas LLP nor anyone in its employment or acting on its behalf have the authority to make any representation or warranty in relation to this property. The areas, measurements and distances are approximate only.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_31",
        "UUID": "18153d57-1755-4d6e-8521-b78bf0f90376",
        "Image": "https://media.rightmove.co.uk/190k/189296/127948292/189296_426630FH_IMG_00_0000.jpeg",
        "Price": "£1,695,000",
        "Address": "Kingston Barns, Old Wimpole Road, Royston, Cambridgeshire, SG8 0BX",
        "Type": "52,272 sq. ft.",
        "Description": "Property description\nOutline Planning Consent Granted for the Erection of Five Substantial Dwellings\n\nSite Area - 0.485 Ha (1.2 Acres) Approximately Plus Possible Further 0.395 Ha (0.98 acre) Available\n\nRural Development Site in a Sought-after South Cambridgeshire Location\n\nCambridge - 9 Miles; Royston- 7 Miles; St Ives - 12 Miles\n\nResidential Development Land in Popular Village\n\nResidential Development Land in Popular Village\n\nDETAILED DESCRIPTION\n\nThe property sits in a tranquil rural setting adjacent to a recently completed barn conversion and a Listed farmhouse. The site has open views to both the north and south with far reaching views.\n\nThe property comprises a redundant farmyard approximately 0.485 hectares (1.2 acres) in size. There are two agricultural buildings on the site and one is in a state of disrepair having suffered some recent storm damage. However, initial clearing up work of the damage and debris is currently underway.\n\nA further area of land immediately to the north of the site measuring approximately 0.395 Ha (0.98 acre) may be available by separate negotiation.\n\n\nLOCATION\n\nThe property is located between the villages of Arrington and Kingston within the county of Cambridgeshire 7 miles north of Royston and 9 miles south-west of the city of Cambridge, with its rich culture and historic buildings.\nThe site is just to the north of the National Trust's Wimpole Hall Estate, a large tourist destination with a wide range of activities and events on offer.\n\nFacilities in surrounding villages include Primary Schools at Orwell, Comberton and Bourn, as well as the Ofsted 'Outstanding' rated village secondary school also at Comberton. There are a number of pubs and restaurants within a few miles radius of the property including the Cambridge County Club. Small village shops and amenities are located in the surrounding villages.\n\nA mainline train stations to London Kings Cross is located at Royston, approximately 15 minutes by car and has journey times between 45 minutes to 1 hour. A direct line train service into Cambridge is available from Foxton which is again approximately 15 minutes by car and has a journey time between 10 and 15 minutes.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_32",
        "UUID": "eb7a7d80-b9f1-47ec-a830-a61cc09eef16",
        "Image": "https://media.rightmove.co.uk/212k/211991/127345337/211991_CNH220046_IMG_02_0000.jpeg",
        "Price": "£1,695,000",
        "Address": "Pampisford Road, Great Abington, Cambridge, CB21",
        "Type": "Detached",
        "Description": "Property description\nMAPLE RISE\n\nThis exclusive development in Great Abington offers a collection of bespoke designed homes which have been built and finished to an exceptional standard by David Reed Homes. With stunning handmade kitchens by award-winning designer, and inglenook fireplaces to selected plots these homes epitomise the charm of contemporary country living. Just three homes remaining.\n\nPLOT 4\n\nOne of just three homes remaining on this stunning development, and host to a large south facing garden, plot 4 is an individually designed detached family home with a double garage and private driveway.\n\nUpon entering the property, one is greeted by a generous entrance hall. To the left is the living room with inglenook fireplace and doors onto rear garden. A large open-plan kitchen/family room with bi-fold doors, leading onto the utility room which benefits from external access, ideal for coming in after those long country walks.\n\nTo the first floor are four generous bedrooms with en-suites to principle bedroom and bedroom 2 and a family bathroom. Bedroom 5 is accessed via a separate stairway and also has an en-suite.\n\nDue for completion early 2023.\n\nABINGTON\n\nGreat Abington is a small village located about 7 miles south of Cambridge. It has excellent transport links including bus route to Babraham Institute, Addenbrookes and Cambridge City Centre. Whittlesford train station, which offers direct links to London Kings Cross and Liverpool Street stations, is just over 4 miles away.\n\nIn the village there is a primary school, local shop,\nvillage hall with cricket grounds, and popular pub ‘The Three Tuns’, which also serves Thai food in its restaurant.\n\nWithin the catchment for Linton Village College just 3 miles away and Sawston Village College just 4 miles away, this village is ever popular with families.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_33",
        "UUID": "ec9deed6-81bd-4d2a-9c29-b15996b66b3a",
        "Image": "https://media.rightmove.co.uk/15k/14135/122700629/14135_CAH220154_IMG_13_0000.jpeg",
        "Price": "£1,680,000",
        "Address": "Kingsley Walk, Cambridge, CB5",
        "Type": "Terraced",
        "Description": "Property description\nStunning, contemporary city home, situated in a particularly pleasant river side location, just moments away from Cambridge city centre.\n\n- Cambridge Railway Station – approx.1.2 miles\n- Midsummer Common – approx. 100yds\n\n• 5 Bedrooms\n• 3 Bath / shower rooms\n• 2 Cloakrooms\n• Stunning open-plan kitchen family room\n• Underfloor heating\n• Garage & driveway parking\n• Private enclosed rear garden\n• Residents gymnasium\n• EPC rating B\n\nKingsley Walk is located off Newmarket Road, just a stone’s throw from the City's shopping centres and universities, as well as restaurants, cinemas, theatres, and supermarkets, all within easy access. The development itself is separated from the river Cam by Midsummer Common.\n\nThe property is beautifully presented and offers incredibly well-proportioned and bright accommodation throughout. Built by Berkley Homes, the property forms part of Cambridge Riverside and is one of just ten substantial townhouses.\n\nArranged over four storeys, 9 Kingsley Walk provides versatile accommodation which extends to some 2993sq.ft. and is ideally suited to family occupation. On the ground floor a bright and airy kitchen family room provides a great space for day-to-day living and entertaining with glazed bi-folding doors overlooking and providing access to the landscaped rear garden. The kitchen is well-appointed with a range of modern cabinetry beneath Corian work surfaces and is equipped with a range of integrated Miele appliances including a steam oven and wine cooler.\n\nThe first floor offers a separate formal sitting room which commands open views across allotments, Midsummer Common and towards the river Cam. At the front of the first floor is an impressive principal suite which includes, a generous double bedroom, dressing room and en-suite bathroom.\n\nThe final two floors include four further double bedrooms, one of which benefits from en-suite facilities, with the remaining three sharing the family bathroom. Whilst the upper floor would make an incredible bedroom, spanning front to back, it would also be ideally suited to use as a home office or studio.\n\nThe west facing rear garden provides a useable, low maintenance outside space, perfect for outdoor dining and entertaining. The garden is split into two level, the lower section being paved with an automatic sun awning above, and the upper laid to lawn retained by railway sleeper walls. The property benefits from 2 parking spaces, a garage and an electric vehicle charging point.\n\nAdditional Information:\n\nTenure: Freehold\n\nServices: All mains services are connected\n\nLocal Authority: Cambridge City Council\n\nCouncil Tax: Band G\n\nViewings: By appointment only with the Selling Agents Carter Jonas\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_34",
        "UUID": "4d866d97-17c9-4833-9278-b53c118fb599",
        "Image": "https://media.rightmove.co.uk/37k/36227/127539164/36227_CAS210097_IMG_00_0000.jpeg",
        "Price": "£1,675,000",
        "Address": "Aberdeen Avenue, Cambridge, CB2",
        "Type": "End of Terrace",
        "Description": "Property description\nFabulous townhouse within south central location.\n\nDescription\n\n63 Aberdeen Avenue is a contemporary styled and well-proportioned modern townhouse constructed in 2011 of buff brick elevations with full height glazing and forms part of this sought after South City location off Brooklands Avenue.\n\nThe property which extends to 2,644 sq ft (246.6 sq m) over four floors and has very well planned flexible and largely open plan living accommodation especially at first floor, is end of terrace which as a result also has glazing to the side elevation which allows additional light to enter.\n\nThe property is situated adjacent to Lennox Walk and has angled views onto Aberdeen Square a large grassed public square. At ground floor is a sizeable kitchen, dining and family room fitted with a comprehensive range of high gloss cabinetry with granite working surfaces, double sink and integrated Siemens appliances including five burner gas hob, dishwasher and a large fridge/freezer. This space is divided up into areas of tiled and oak flooring and is fully glazed to the front looking onto the Aberdeen Avenue tree belt. There is a good-sized utility room to the rear with a further one and a half bowl sink & drainer and spaces for washing machine and tumble dryer.\n\nAt first floor is a long open plan triple aspect reception space which is currently arranged into three separate zones. The front area is a more informal snug sitting area with a large picture window to the front and has a feature gas pebble fireplace however this could equally be used as a formal dining area. The central space is currently used as a dining and occasional work & study space. To the rear is the large full width reception space fully glazed with bi-parting sliding doors to the particularly impressive and well laid out main terrace which has brick walls and plenty of space for relaxing, entertaining and alfresco dining. There is oak flooring to the whole of this floor which also includes a large landing space currently used as a library area.\n\nThe two upper floors are carpeted and comprise four bedrooms. The second floor has two very large doubles, one overlooking the tree belt to the front and the other has wall to wall wardrobes and an en suite shower room, this along with the other rear bedroom has access to a full width balcony overlooking the main terrace below. Another large landing area to the front with dual aspect glazing which can be used as a further work & study space plus a large family bathroom, fully tiled with Villeroy and boch sanitaryware, as all bathrooms in the house, completes this floor.\n\nThe principle bedroom suite occupies the whole of the top floor and is substantial. The main bedroom area is to the front and has a further sitting area with L shaped full height and width glazing to two sides of the large terrace which has super elevated views into the tree belt and Aberdeen Square. To the rear is a spacious walk in dressing area with wall to wall hanging rails and the en suite bathroom with both separate shower and bath.\n\nBelow the main terrace, accessed internally from the hallway, or by the covered shared car access (via an electric vehicle gate at the other end of the terrace) and by the pedestrian gates is the private garage area with ample space for 2 cars, numerous bicycles/scooters etc. and further storage. In addition to this private garage parking there is a residents parking scheme in operation with resident and visitor permits available from Cambridge City Council at modest annual cost.\n\nThe property which has wet gas fired underfloor heating throughout, with additional heated towel rails in the bathrooms, plus mains pressure hot water, via an upgraded boiler & cylinder, can be seen in greater detail on the attached floor plan.\n\nLocation\n\nAberdeen Avenue is situated within the award winning Accordia development just off Brooklands Avenue and within very easy reach of Cambridge Railway Station with services to London from 50 minutes.\n\nThe Cambridge University Botanic Garden, a 40 acre heritage garden with glasshouses and a popular Café is just 0.5 miles away.\n\nThere are independent schools such as The Leys, St Faiths, Stephen Perse and St Mary plus State schools for all ages including Hills Road Sixth Form College.\n\nExcellent shopping & entertainment facilities and cultural amenities are available in the historic centre of the city including a busy daily market, the Grand Arcade shopping mall and an art house cinema. Further mini-market shopping and other entertainment facilities are available at the end of Brooklands Avenue, around the station and in the adjacent Cambridge Leisure complex which includes a multiscreen cinema, bowling alley and live music, comedy & theatre venue The Junction.\n\nAll distances and times are approximate.\n\nSquare Footage: 2,644 sq ft\n\n\n\nDirections\n\nFrom London, heading north along the M11, exit at junction 11 and proceed through Trumpington into Cambridge. Once on Trumpington Road bear right at the main junction onto Brooklands Avenue. Take the first right hand turn into Aberdeen Avenue, the property is the last house on the left opposite the mature tree belt.\n\nAdditional Info\n\nCouncil tax band - G\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_35",
        "UUID": "702c50f8-4dfd-4f5b-8227-a22c9532f152",
        "Image": "https://media.rightmove.co.uk/241k/240587/124315430/240587_CAM220049_IMG_01_0000.jpeg",
        "Price": "£1,650,000",
        "Address": "Lower End, Swaffham Prior, Cambridge, Cambridgeshire, CB25",
        "Type": "Detached",
        "Description": "Property description\nGuide Price: £1.65m - £1.8m\n\nAccessed through private gates, a large sweeping driveway leads you to this quite magnificent four-bedroom Grade 2 listed period home, sitting on a grand plot in the region of two acres, dating back to the 14th Century with later additions, sympathetically extended on at least three occasions to its current incarnation as a substantial and delightful country family home which the current vendors describe as inviting and very spacious, offering plenty of light throughout whilst maintaining a very private position.\n\nGuide Price: £1.65m - £1.8m\n\nCloaked in history , of which has been fully documented in a new and professionally written book, this property was originally a Medieval Hall House with its history evidenced throughout with original architecture and character with numerous exposed beams, with some featuring the original trusses and carpenter’s marks, as well as some stunning brick fireplaces, which collectively bring a sense of warmth.\n\nThe property has a much larger than typical drive, space for 20 - 25 cars and very easy access for deliveries, leading to the main house to the side, with the grounds outside not only backing onto green space but also providing secluded private gardens with mature and colourful shrubbery, trees, inviting patios and BBQ cooking area, a large lawn, and wood stores; making this a fabulous family-friendly outside retreat and perfect for entertaining. Not forgetting this home enjoys its own orchard to the rear and is even visited by deer often that roam the garden.\n\nThe accommodation briefly comprises of an Entrance Hallway, Drawing Room, Sitting Room, Dining Room, Study, four impressive character Bedrooms, two Bathrooms, fully connected Infinity Broadband, as well as boasting a Barn Garage for three to four cars with power, and permissions in place to convert to an annexe/living quarters as well as permission to build another studio annexe plus internal house alterations. (See planning app 18/00170/LBC). All of which is perfectly located within close proximity to the schools, playground, and village public house.\n\nSurrounded by beautiful countryside the property is close by to Devil’s Dyke, a linear earthwork from Saxon times and a popular walk connecting the delightful villages of Reach and Wood Ditton, and with additional quite wonderful walks to Great Wilbraham and Fordham, with country pubs, many offering fabulous food, aplenty.\n\nFurther local popular walks are to be found in the stunning grounds of Anglesey Abbey, on Newmarket Heath, and Wicken Fen. For cyclists, avoid the roads and enjoy the 25-mile Cambridge to Ely National Cycle route which can be joined two kilometres beyond the village.\n\nThere is a fabulous Farm Shop within 5 minutes walk Snake Farm with local produce, local groceries are a 15 minutes cycle to Swaffham Bulbeck, and there is even an Old Mill baking in the village where you can buy flour. Additionally, just 4km away in Burwell you have a local independent Coffee Shop and a Fuel Station with a Co-op .\n\nFor entertainment, there is historic Cambridge, Ely with its brand new Multi-Plex Cinema, Newmarket, and Bury St Edmunds all offering a huge diversity of arts (museums, thriving music venues, mainstream and arthouse cinemas, and historic theatres) sports venues, and facilities including the two wonderful Race course at the ‘home of racing’, buoyant city centres for shopping and a choice of dining from Michelin starred restaurants to cosy gastropubs and a wide variety of cuisines from around the world.\n\nThere is a great golf course at Newmarket, Quy Mill Gym and swimming pool, a 5-minute drive away, and fantastic Kayaking at the River Cam at Upware 5 miles away, great also for paddling and various other water activities.\n\nTrain links from Cambridge and Cambridge North bring the West End and the City of London within easy reach, and direct links from Cambridge take you to Stansted and Gatwick Airports.\n\nFinally, whilst Cambridge is world-famous for its University, education needs from nursery upwards are served to a high standard by great local schools feeding outstanding Sixth Form Colleges in the state sector and a plethora of highly regarded private schools within a short drive to Ely, Newmarket, and Cambridge.\n\nClick the link below to view our Matterport 360 Tour:\n\n\n\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_36",
        "UUID": "5346c516-58a0-43d4-81a1-b7840506d9ab",
        "Image": "https://media.rightmove.co.uk/10k/9527/128166584/9527_100539080732_IMG_00_0000.jpeg",
        "Price": "£1,650,000",
        "Address": "High Street, Balsham",
        "Type": "Detached",
        "Description": "Property description\nAn elegant and substantial Georgian house in need of sympathetic updating, together with a coach house/former stables and delightful, mature gardens of just under an acre. The property provides versatile and well proportioned accommodation extending to about 3700 sqft and incorporates many unique features of character including high ceilings, sash windows and fine fireplaces.\n\nPark House occupies a rather special and most desirable location in the heart of the village on the corner of the high street and Woodhall Lane and backs onto paddocks. The highly sought after South Cambridgeshire village of Balsham provides an excellent range of amenities, many of which are just a short walk away and include a store/post office, delicatessen/coffee shop, primary school, church, two inns and a recreation ground. The university city of Cambridge is just 10 miles away and for the commuter the village is well placed for access to the M11 motorway and the main line stations at Whittlesford, Audley End and Cambridge.  \n\nENTRANCE PORCH with outside light, pillars to either side of a panelled front entrance door to: \n\nENTRANCE LOBBY with stone flooring, part panelling, high roof light and glazed door leading to: \n\nRECEPTION HALL with a feature decorative former fireplace, feature panelled walls and decorative picture rail. Built-in storage cupboard understairs, natural wood style flooring, decorative archway leading to: \n\nINNER HALL with panelling to walls, decorative picture rail, staircase off to first floor, built-in cloaks/storage cupboard and door off to: \n\nCLOAKROOM with low level w.c. and wash hand basin with splashback, double radiator, secondary double glazed sliding sash windows to front aspect. \n\nSITTING ROOM with a feature Adam style open fireplace with marble surround and decorative side and mantel, high ceilings with moulded cornices and sliding sash windows to rear aspect and feature full height bay to side aspect overlooking the gardens with a pair of glazed doors leading to the paved terrace, two double radiators, recess to side of fireplace with fitted storage cupboard and shelving. \n\nSTUDY/FAMILY ROOM with a feature open fireplace with marble surround and decorative side and mantel, recess to either side with extensive fitted bookshelves and cupboards beneath and further bookshelves to one wall, high ceilings with moulded cornices and picture rail, two double radiators, secondary double glazed sliding sash windows to front aspect and feature large bay window to side aspect with double radiator and sliding sash windows overlooking the gardens. \n\nDINING ROOM with an open fireplace with raised tiled hearth, glass canopy and a unique carved decorative surround and mantel, high ceilings with moulded cornices, two radiators, and a large bay window to front aspect and feature panelling, door to: \n\nREAR LOBBY passageway with tiled floor leading to a former cloakroom with recess with wash hand basin, tiled splashback, water softener, radiator and windows to side aspect with frosted glass, glazed door to: \n\nKITCHEN/BREAKFAST ROOM with inset sink unit with mixer taps, cupboards below, extensive base units comprising work surfaces with cupboards and drawers below, dresser style unit with glazed cabinet and shelving, space and plumbing for dishwasher, integrated Bosch 4 point induction hob with concealed extractor cooker hood above, and integrated Bosch oven and grill, double radiator, ceramic tiled flooring, space for upright fridge/freezer, door to a large walk-in pantry with shelving, and a pair of sliding double glazed doors leading to: \n\nCONSERVATORY A wonderful light and spacious area which enjoys stunning views over the gardens and has a high semi-vaulted glazed ceiling, ceramic tiled flooring, fitted storage cupboards and a pair of full height sealed unit double glazed doors leading to paved terrace. \n\nGARDEN ROOM with fitted worktops, storage shelves, outside tap, ceramic tiled floor, built-in boiler cupboard housing an oil fired boiler and sealed unit double glazed windows to rear aspect. \n\nON THE FIRST FLOOR  \n\nGALLERIED STYLE LANDING with feature panelling, double radiator and a sliding sash window to rear aspect with views over the gardens and adjoining farmland. \n\nPRINCIPAL BEDROOM with two double radiators, sliding sash windows to side aspect overlooking the gardens, recess to side of chimney breast and door to: \n\nENSUITE DRESSING ROOM with two fitted double wardrobes, double radiator, sliding sash windows to front aspect and door to: \n\nENSUITE SHOWER ROOM with pedestal wash hand basin, low level w.c., built-in tiled shower cubicle and shower unit with glazed door, tiled walls to side and large walled mirror, striplight/shaver socket, radiator, sliding sash window to side aspect. \n\nDOOR LEADING TO:  \n\nINNER LANDING with fitted bookshelves, roof light, trap door to roof space and built-in storage cupboard, radiator, built-in airing cupboard housing hot water cylinder. \n\nBEDROOM 2 with two double radiators, pedestal wash hand basin, sliding sash windows to front aspect. \n\nBEDROOM 3 with double radiator, range of fitted wardrobes with cupboards above, secondary double glazed sliding sash windows to front aspect. \n\nBEDROOM 4 with double radiator, secondary double glazed sliding sash windows to rear aspect. \n\nBEDROOM 5 with fitted double wardrobes, shelved cupboards to side, fitted shelving, double radiator, secondary double glazed sliding sash windows to front aspect. \n\nBATHROOM 1 with white suite comprising bath with shower attachment, wash hand basin, low level w.c. and bidet, large wall mirror, electric striplight/shaver socket, double radiator, ceramic tiled walls around, heated towel rail and secondary double glazed windows to rear aspect. \n\nBATHROOM 2 With white suite comprising panelled bath, fitted shower cubicle and wall mounted shower unit, pedestal wash hand basin and low level w/c, double radiator and secondary double glazed windows to rear aspect \n\nOUTSIDE To the front of the property there are a pair of wrought iron gates providing access to a long private driveway and extensive courtyard style parking area adjacent to which is a detached OUTBUILDING/FORMER COACH HOUSE which comprises two sets of double wooden doors which provide access to a GARAGE and STORE, light and power and panelled door to side, opening through to REAR LOBBY AREA with wooden steps leading up to ATTIC ROOM with light and power, windows to side and rear aspect, trap door to roof space and door to further eaves storage area. Door off the rear lobby to a workshop/store with fitted cupboards and power, further wooden door to STORE 2. Adjacent to the main building there is a former stable block now used as storage.\n\nThe delightful and generous mature gardens are a very special feature and extend to just under an acre and are principally laid to lawn and enjoy a high degree of privacy and seclusion. Immediately to the rear of the property there are paddocks that belong to a neighbouring property. Immediately adjacent to the house itself there is a large L-shaped paved terrace with borders to side and a delightful part walled formal garden area interspersed with paved pathways and incorporating a wide variety of roses and shrubs. There is also a kitchen garden with vegetable plot, fruit bushes and fruit trees and access to further paved enclosed walled courtyard style area with former dog kennels and oil storage tank with gated access leading to the front parking courtyard area.\n\nThere is also a covered side porch with outside light and outside water tap next to the former kennel. \n\nAGENTS NOTE There are a pair of wooden gates located to the side of the former coach house which lead off to Woodhall Lane and provide access to the principal gardens. There was originally an approved planning consent dated 31st March 1991 (S/2001/90/F) for a detached bungalow. this consent has now lapsed and prospective interested parties in Park House should make their own enquiries with South Cambridgeshire district council to ascertain whether or not there may be a possibility of gaining any new consent. \n\nMATERIAL INFORMATION Tenure - Freehold\nCouncil Tax Band - G \nBrochures\nOnline Glossy\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_37",
        "UUID": "0e0e911c-871b-4ea6-9ecd-248955b16bbe",
        "Image": "https://media.rightmove.co.uk/10k/9527/127809815/9527_100539080808_IMG_00_0000.jpeg",
        "Price": "£1,650,000",
        "Address": "Chesterton Road, Cambridge",
        "Type": "Terraced",
        "Description": "Property description\nAn imposing and substantial bay fronted Victorian town house occupying a commanding and prominent position enjoying a wonderful vista with breathtaking views over Jesus Green and the River Cam. The property incorporates many original character features including moulded cornices, large bay sash windows, cast iron firegrates and high ceiling to some of the principal rooms. The property provides well proportioned and versatile accommodation over four storeys and includes a self contained basement apartment. The property is conviniently located just a short walk from Jesus Green and within easy reach of the city centre, railway station and major routes.  \n\nPANELLED GLAZED WINDOW WITH TRANSOM ABOVE picture rail, moulded cornices, coat hooks, part glazed door to: \n\nRECEPTION HALL with radiators with decorative covers, dado rail, decorative arch leading to staircase up to first floor. \n\nINNER HALL with part glazed door to basement. \n\nDINING ROOM A spacious and light room with feature large bay window to front aspect, tiled fireplace with inset gas coal effect fire, tiled hearth, marble surround and mantel, picture rail, moulded cornices, elaborate plaster ceiling rose, archway which is open to the front sitting room with tiled fireplace with marble surround, picture rail, moulded cornicing and elaborate plaster ceiling rose, sliding sash windows to rear aspect overlooking the gardens. \n\nKITCHEN/BREAKFAST ROOM with range of units incorporating a stainless steel one and a half bowl sink unit with mixer taps, cupboards below, worktops to side with integrated dishwasher and worktop to the other side with space and plumbing for washing machine, extensive base units comprising worktops with cupboards and drawers below, integrated refrigerator and freezer, integrated 5 point induction hob with stainless steel extractor cooker hood above and glazed splashbacks, two integrated Miele ovens and further extensive range of wall storage cupboards, sliding sash windows to rear aspect with wonderful views over the rear garden and two large feature sash windows to side aspect with stained glass inserts. \n\nON THE FIRST FLOOR  \n\nLANDING with radiator, further stairs to front landing with built-in storage cupboard understairs and staircase leading up to second floor. \n\nBEDROOM 1 with radiator, two sets of sliding sash windows with secondary glazing to front aspect with a wonderful vista enjoying views over the River Cam, feature central tiled fireplace, moulded cornicing. \n\nBEDROOM 2 with cast iron firegrate with wooden surround and mantel, recess to side with fitted wardrobes and recess to the other side with a wash hand basin with cupboards below, double radiator, sliding sash windows to rear aspect overlooking the gardens. \n\nBATHROOM An exceptionally spacious principal bathroom with a bath set on claw and ball feet with mixer tap and shower attachment, pedestal wash hand basin with tiled splashback, wall mirror above, electric shaver socket, large walk-in shower cubicle with tiled surround and wall mounted shower unit with large head shower and hand held shower, w.c., bidet, central cast iron firegrate, high semi-vaulted ceiling and exposed timbers, traditional style radiator, heated towel rail/radiator, natural wood style flooring, 3 sliding sash windows with frosted glass. \n\nCLOAKROOM with w.c., wash hand basin with tiled splashback, radiator, sliding sash window with frosted glass. \n\nON THE SECOND FLOOR with double glazed Velux window to front aspect. Large built-in storage room with light. \n\nBEDROOM 4 with double radiator, fitted wardrobe and natural wooden flooring and sliding sash window to front aspect with stunning views over the River Cam and associated boats. \n\nBEDROOM 5 with double radiator, pedestal wash hand basin with tiled splashback, double glazed Velux window to rear aspect, fitted wardrobes and sealed unit double glazed window to rear aspect with views over the rear gardens. \n\nBASEMENT AREA comprises: \n\nENTRANCE LOBBY with recessed storage area, tiled floor, part glazed door to: \n\nLOBBY with coat hooks, part glazed door to: \n\nENTRANCE HALL with stairs leading up to first floor and main hall in the main house, dado rail, radiator, built-in storage cupboard understairs with coat hooks, natural wood style flooring. \n\nFRONT RECEPTION ROOM with cast iron firegrate with decorative inserts and wooden surround and mantel, large bay window to front aspect with three sliding sash windows, radiator, natural wood style flooring, moulded cornicing, picture rail, ceiling rose. \n\nBEDROOM with extensive range of fitted wardrobes and storage cupboards, matching bedside cabinets and dressing table, secondary double glazed sliding sash windows to rear aspect. \n\nREAR HALL with glazed door through to Kitchen and part glazed door off to: \n\nBATHROOM with bath and ceramic tiled walls, shower attachment and mixer taps, pedestal wash hand basin, low level w.c., and bidet, radiator, windows to rear aspect with frosted glass, wall mirror and electric shaver socket. \n\nDINING ROOM with radiator, sliding sash window to side aspect, built-in shelved storage cupboard, built-in cupboard housing boiler, archway through to: \n\nKITCHEN with inset stainless steel one and a half bowl sink unit with mixer taps, extensive base units comprising worktops with cupboards beneath, space and plumbing for appliances, space for cooker and concealed extractor cooker hood, glazed windows to side and rear aspect, ceramic tiled floor, glazed door to paved terrace and rear gardens. \n\nOUTSIDE To the front of the property there is a wrought iron gate which leads to a paved courtyard style area with a number of mature shrubs, bushes, trees and hedgerow around and stone steps with wrought iron railings and decorative inserts leading up to the front entrance door, stone steps from this area lead down to a concreted area in front of the basement and a further wooden gated access leading to a large covered passageway which in turn provides access to the rear garden.\n\nTo the side of the house there is a paved courtyard style area with covered bin store, outside tap, old butler sink and this in turn leads through to a large paved terrace immediately adjacent to the house itself with a covered lean-to/barbecue area. There are also external lights and power sockets and from this area pathway leads through to the delightful rear garden which is principally laid to lawn and has a great number of mature shrubs, bushes, trees and well stocked borders around. At the far end of the garden there is a timber arch which leads to a timber pathway and this in turn leads to a raised timber deck with a large timber constructed garden store with light and power. Adjacent to the deck there is also a large greenhouse style area with heavy duty plastic walls and ceiling. \n\nMATERIAL INFORMATION Tenure - Freehold\nCouncil Tax Band - G \nBrochures\nOnline Glossy\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_38",
        "UUID": "51a062dc-5a4c-4bfb-a310-8a86a3cc009f",
        "Image": "https://media.rightmove.co.uk/242k/241106/127719383/241106_33d9aa54-42e6-4a2c-aa93-f1fbe4a60486_IMG_00_0000.jpeg",
        "Price": "£1,600,000",
        "Address": "Barway Road, Barway, CB7",
        "Type": "Detached",
        "Description": "Property description\nA recently constructed and highly energy efficient six bedroom detached property with seven acres of land (STS) and benefitting from seven years build zone warranty. Stepping inside you are greeted with the impressive double height entrance hall with attractive oak staircase rising to the first floor. On the ground floor is the exceptionally spacious kitchen/dining room which opens through into the living room with Inglenook style fireplace. There is also a useful utility and cloakroom. Also on the ground floor is the integral double garage, shower room and family room with its own kitchen that offers the possibility of turning this room into an annexe for multigenerational living. Upstairs from the galleried landing are six double bedrooms, four with ensuite facilities and dressing rooms.\n\nEPC Rating: B\n\nENTANCE HALL\n(4.3m x 4.8m)\n\nStunning double height entrance with double composite doors at the front with full height double glazed windows either side, glazed double solid wood doors through into the kitchen/dining room, solid wood doors into the rear lobby/family room and double garage, attractive oak staircase rising to first floor, underfloor heating to tiled flooring and downlighters.\n\n\n\nFAMILY ROOM\n(5.8m x 7.3m)\n\n5.8m x 7.3m x 9.4m (into the Kitchen area) Twin doubled glazed French doors at the rear, double glazed window to the rear. Range of wall and base mounted units and drawers with quartz worksurfaces over incorporating breakfast bar, sink and draining board with mixer tap, space and plumbing for appliances, underfloor heating and downlighters.\n\n\n\nREAR LOBBY\n\nSolid wood doors into the shower room and into boiler room which houses the controls to the underfloor heating, ideal area for shoes and coats, tiled flooring.\n\n\n\nSHOWER ROOM\n\nPart frosted double glazed door to the rear, one and a half shower cubicle, low level W.C with hidden cistern, wash hand basin with vanity drawers below and mixer tap over, heated towel rail, underfloor heating and downlighters.\n\n\n\nKITCHEN/DINING ROOM\n(7.3m x 10.9m)\n\nDouble glazed window to the front, two double glazed windows to one side and one to the other. Double glazed bi-folding doors leading out to the patio area, open through into the living room and solid wood door into the utility. The kitchen has an extensive range of wall and base mounted units and drawers with quartz worksurfaces over incorporating island and breakfast bar, five ring induction hob, two eye level double ovens, coffee machine, warming drawer, one and a half sink and draining board with instant hot water mixer tap over, space and plumbing for American style fridge/freezer, two integrated dishwashers and double wine fridge. Underfloor heating to tiled flooring and downlighters.\n\n\n\nLIVING ROOM\n(6.1m x 7.3m)\n\n7.3m x 6.1m (extending to 7.5m) Walk in box bay window at the rear with full width bi-folding doors, double glazed windows either side allowing a fantastic amount of natural light, additional double glazed window to the side. Feature inglenook style fireplace with timber mantle and inset multi fuel stove, underfloor heating to tiled flooring.\n\n\n\nUTILITY ROOM\n(2.9m x 4.2m)\n\n4.2m x 2.9m (narrowing to 1.7m) Double glazed door at the rear, double glazed window to the side, solid wood door into the cloakroom, base mounted units with quartz worksurface over, sink and draining board with mixer tap over, space and plumbing for washing machine tumble dryer, underfloor heating to tiled flooring and downlighters.\n\n\n\nCLOAKROOM\n\nFrosted double glazed window to the side, low level W.C with hidden cistern, wash hand basin with vanity cupboard below and mixer tap over, under floor heating to tiled flooring.\n\n\n\nGALLERIED LANDING\n\nAmazingly spacious landing with full width window across the front, double glazed French doors to the rear with double glazed windows either side allowing an excellent amount of natural light leading out to the decked balcony. Solid wood doors into all bedrooms and bathroom and two fitted storage cupboards, floor to ceiling radiator, loft access and downlighters.\n\n\n\nMASTER BEDROOM\n(5m x 7m)\n\nDouble glazed windows to the front and side, double radiator, solid wood doors into the ensuite and dressing room.\n\n\n\nDRESSING ROOM\n\nFitted units and drawers providing a fantastic amount of hanging and shelving space, radiator and downlighters.\n\n\n\nENSUITE\n(2.3m x 3m)\n\nFrosted double glazed window to the side with quartz plinth, panelled bath with mixer and shower attachment over, one and half shower cubicle, over sized wash hand basin with vanity drawers below, low level W.C, floor to ceiling heated towel rail and downlighters.\n\n\n\nBEDROOM TWO\n(4.2m x 6.1m)\n\nDouble glazed windows to the rear and side, double radiator, solid wood doors into the ensuite and dressing room.\n\n\n\nENSUITE\n(2.2m x 3.4m)\n\nFrosted double glazed window to the side, panelled bath with mixer and shower over, one and a half shower cubicle, wash hand basin with mixer tap over and vanity drawers below, low level W.C, floor to ceiling heated towel rail and downlighters.\n\n\n\nBEDROOM THREE\n(4.9m x 6m)\n\nDouble glazed window to the rear, solid wood door in the Jack and Jill ensuite.\n\n\n\nJACK AND JIL ENSUITE\n\nFrosted double glazed window to the rear, wash hand basin with vanity drawers below, additional vanity drawers fitted with quartz worksurface over, panelled bath with mixer and shower attachment, one and a half shower cubicle, low level W.C, floor to ceiling heated towel rail and downlighters.\n\n\n\nBEDROOM FOUR\n(5.8m x 6.1m)\n\nDouble glazed windows to the front and to the side, solid wood doors into the dressing room and ensuite.\n\n\n\nENSUITE\n\nFrosted double glazed window to the side with quartz plinth, panelled bath with mixer and shower attachment over, wash hand basin with mixer tap over and vanity drawers below, low level W.C, floor to ceiling heated towel rail and downlighters.\n\n\n\nBEDROOM FIVE\n(3m x 4.8m)\n\nDouble glazed windows to the front and to the side and double radiator.\n\n\n\nBEDROOM SIX\n(3.1m x 4.3m)\n\nDouble glazed window to rear, double radiator.\n\n\n\nINTEGRAL DOUBLE GARAGE\n(7.1m x 7.4m)\n\nTwin up and over electric garage doors to the front, power and lighting connected.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_39",
        "UUID": "e714bed4-fc5e-4c9d-b641-5900e4b81d69",
        "Image": "https://media.rightmove.co.uk/94k/93790/128480492/93790_CAM220113_IMG_00_0000.jpeg",
        "Price": "£1,600,000",
        "Address": "Ermine Way, Arrington, Royston, Hertfordshire",
        "Type": "Detached",
        "Description": "Property description\nThe Old Court House is an impressive Victorian period property which was part of the original Wimpole Hall Estate as a Magistrates Court and Police houses. Retaining a wealth of period features, the house offers elegant, light-filled spaces totalling almost 3,500 sq. ft. arranged over two floors.\n\nThe spacious open-plan kitchen and orangery are flooded with natural light via a large lantern roof and tall French doors to the terrace. Alongside is a utility and cloakroom, with a luxurious formal dining room completing the floor.\n\nIn addition, the ground floor has an array of high-ceilinged reception rooms, including a breath-taking drawing room with French doors to the landscaped topiary garden, a sitting room, a snug and a bright study, all of which feature characterful fireplaces.\n\nWith two staircases to the first floor, there are 5 generously sized bedrooms, one of which features an ensuite shower room. There also a modern family bathroom with dual sinks.\n\nWithin walking distance to the Wimpole Hall National Trust estate, the charming and picturesque village of Arrington offers a village hall, several local clubs, a public house, church, and a plethora of countryside pursuits surrounding. The village is also a ten-minute drive to nearby Royston, which has trainline access to King Cross Station in under 40 minutes and Cambridge in under 15 minutes. Royston also provides an extensive array of amenities including supermarkets, shops, sports clubs, a leisure centre, doctors’, and dentists’ surgeries. The M11 is under 10 miles distant, offering convenient road links. Notable schools in the area include King’s College and St Francis’, St Edmund’s and St John’s Colleges.\n\nRoyston station 5.7 miles (Cambridge 14 minutes, London Kings Cross 36 minutes), M11 (J12) 9 miles, Cambridge 11.1 miles, London Stanstead Airport 31.3 miles\n\nThe property boasts a contemporary landscaped garden and is completely private thanks to tall topiary hedging. Two large, gravelled driveways, accessed via Automatic Gates from the main road, give plenty of off-road parking and access to the house and its separate detached garage. A terrace spans the width of the property and a large decked area provide the ideal spots for al fresco dining and entertaining. Surrounding are sections of carefully manicured level lawn and formal borders, while vibrant climbing plants adorn the home’s façade.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_40",
        "UUID": "ca3c7028-6511-4ce2-ab88-1e7b97497bce",
        "Image": "https://media.rightmove.co.uk/15k/14135/106859639/14135_CAH210141_IMG_00_0000.jpeg",
        "Price": "£1,600,000",
        "Address": "Station Road, Impington, Cambridge, CB24",
        "Type": "Undefined",
        "Description": "Property description\n• 135 Station Road, Histon, Cambridge, CB24 9NP\n• 5,933 sq ft / 551.29 sq m\n• Substantial Period Office Building\n• Excellent Local Transport Links\n• Site Area 0.44 / 0.18 hectares\n• Opposite the Entrance to Vision Park\n• Guide Price: £1,600,000\n\nThe Property comprises two elements: a former detached two storey dwelling that has been converted into office accommodation ('The Red House') and a single storey warehouse to the rear, situated on a self-contained site with yard / car parking space. The building is a local landmark of historical significance and originally the family home of Chivers jam, whose products are still locally produced and shipped around the world.\n\nThe front part of the site is occupied by The Red House which is an attractive building of solid brick construction under a pitched tiled roof and with two large bay windows to the front elevation. The windows have recently been replaced with solid hardwood, double glazed windows. There is a kitchen area and WC. Character features have been retained including high ceilings of approximately 3 metres to both ground and first floor.\n\nTo the rear of The Red House there is a garden area and a warehouse which has solid brick elevations under a corrugated roof covering. This is adjoined to The Red House and comprises office / ancillary accommodation, a boiler room, kitchen, stores and WCs.\n\nThe Property is located in the village of Histon which lies approximately 3 miles north of Cambridge city centre. Histon is connected to its neighbouring village of Impington and provides range of local facilities. The Property is situated in an established commercial location opposite Vision Park, an office development with occupiers including Santander, Regus and AX Intelligence.\n\nThe Property benefits from good transport links, situated 0.2 miles north of the Guided Busway which provides a fast and frequent service to Cambridge North railway station (6 minutes) and Cambridge city centre (16 minutes) as well as St Ives and Huntingdon. Cambridge North railway station, approximately 3.5 miles south east of the Property, provides a direct service to London Kings Cross. There is also a bus stop immediately to the front of the Property on Station Road, providing services to Cottenham in the north and to Cambridge in the south.\n\nFor al enquiries please contact Lucy Atkins at Carter Jonas on .\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_41",
        "UUID": "caf0c29c-df6a-40f4-a3a3-6e1f4ea153bf",
        "Image": "https://media.rightmove.co.uk/35k/34529/124439552/34529_CAM140357_IMG_00_0000.jpeg",
        "Price": "£1,600,000",
        "Address": "Pearce Close, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nA rare opportunity to acquire a cul-de-sac building plot in one of the most highly regarded and desirable areas of Cambridge, with full planning permission in place to create a substantial and contemporary detached house that opens onto a south facing back garden, to sit as neighbour to an existing well presented, 4 bedroom house, at number 6 Pearce Close, with its own planning in place for a rear extension and remodelling.\n\nCambridge City Centre 1 mile, M11 (junction 12) 1.25 miles, Mainline Railway Station (King’s Cross and Liverpool Street lines) 2 miles, (distances are approximate).\n\nAn incredibly rare development opportunity in this coveted city location, the site offers prospective purchasers the chance to acquire an existing detached property with scope for improvement as well as a generous plot with full planning given to create a second substantial property.\n\nThe existing house, 6 Pearce Close, originally dates from 1983 and is constructed with brick elevations under a tiled roof. Internally, the property offers 1,356 sq ft (126 sq m) of spacious and versatile accommodation arranged over 2 floors, which enjoys a light and airy feel throughout. The property further benefits from approved planning permission to demolish and rebuild the kitchen/dining room to create a further 108 sq ft of living space.\n\nThe plot which will home number 7 is situated at the end of a no through road and will be the natural focal point upon entry to Pearce Close. Measuring 0.06 of an acre (0.024 hectares), the plot has the fantastic benefit of having full planning permission in place to build a 3 storey detached house which affords the eventual purchaser the luxury of being able to \"self-build\" the property and choose the final specification and finish that they desire. Copies of the planning permissions (Ref: 20/04715/FUL) are available via Great Cambridge Shared Planning website and following the planning link.\n\nThis opportunity provides a number of options to the owner of 6 & 7 including the convenience of living in number 6 during the construction of the new property at number 7, coupled with the subsequent benefit of having a potential rental income on one or other of the properties. Alternatively, the plot of land at number 7 could be incorporated into the plot of number 6 to enhance the size of the garden alongside considerably improving and extending the existing house.\n\nPearce Close lies within the highly regarded Newnham area, which is widely recognised as one of the best residential locations in the city. Local facilities include a post office, chemist, bakers, butchers, grocers, small supermarket and the highly regarded Newnham Croft Primary School. The newly improved Penarth Place Play Area is just 250 meters away and Lammas Land Recreation Ground, with a large children’s play area, tennis court and paddling pool, is within half a mile. The historic city centre is about 1 mile away, providing an attractive combination of ancient and modern buildings, colleges, winding lanes, the tree lined River Cam and an extensive range of shopping facilities. The property is also extremely well placed for many of the colleges, University departments, “The Backs” and delightful walks along the river to the nearby village of Grantchester. An excellent range of schools for all ages are within half or three quarters of a mile including St John’s, King’s, The Leys, Stephen Perse, Hills Road Sixth Form College, St Mary’s and Newnham Croft. For the sport enthusiasts, the Cocks and Hens Tennis Club, with its 8 floodlit courts, 2 grass courts and clubhouse, is only a short distance away.\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_42",
        "UUID": "c78fae3a-1129-496c-aeae-98192dc68e2f",
        "Image": "https://media.rightmove.co.uk/35k/34529/128375747/34529_CAM220424_IMG_00_0000.jpeg",
        "Price": "£1,600,000",
        "Address": "Panton Street, Cambridge, Cambridgeshire",
        "Type": "Terraced",
        "Description": "Property description\nA stylish and immaculately presented Georgian townhouse in a premier central city location.\n\nCambridge city centre about half a mile, Mainline Railway Station about half a mile, M11 (Junction 11) about 2.5 miles.\n\nThis attractive, period townhouse forms part of a terrace which is believed to date from the Georgian period and is Grade II listed to signify its architectural and historical interest.\n\nThe current owner has made substantial and comprehensive alterations to create an outstanding home which has been finished to an exceptionally high standard. The accommodation is immaculately presented throughout and benefits from the charm and character of the original period building with all the benefits of tasteful, modern improvements.\n\n\n\nPanton Street is situated at the eastern end of Trumpington Road and runs between Lensfield Road and Bateman Street. Lying within a Conservation Area, it is conveniently placed for access to the city centre and University Botanic Gardens. Several of the city’s Colleges and University departments are close by and some of the most highly regarded schools in the city, such as St Faith’s. St Mary’s, The Leys and The Stephen Perse, are within easy walking or cycling distance and Parkside Community College is within about half a mile. The city has also become a ‘high-tech’ and ‘bio-tech’ hub with the University Research and Development laboratories, the internationally renowned Cambridge Science Park and Addenbrooke’s Hospital/Biomedical Campus, one of the largest centres of health, science and medical research in the world.\n\nFor the commuter, the nearby M11 provides good access to Stansted Airport, the M25 and London and the city’s mainline railway station provides regular services to King’s Cross and Liverpool Street in about 48 and 67 minutes respectively.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_43",
        "UUID": "e7bd6540-b30e-4130-b1c0-a9a548de3ab7",
        "Image": "https://media.rightmove.co.uk/15k/14135/123892772/14135_CAM200132_IMG_00_0000.jpeg",
        "Price": "£1,550,000",
        "Address": "Coppice Avenue, Great Shelford, Cambridge, CB22",
        "Type": "Bungalow",
        "Description": "Property description\nSecluded, single storey dwelling, situated in this much sought-after private road within the village of Great Shelford, upon a mature plot of circa 0.42 acre.\n\n- Cambridge Bio-Medical Campus - approx. 2.7 miles\n- Cambridge Railway Station - approx. 4.2 miles\n\n• 2/3 Bedrooms\n• Spacious sitting room\n• Dining room\n• Study\n• Potential for redevelopment / extension\n• Driveway parking\n• Garage & workshop\n• Large mature grounds\n• Swimming pool\n• EPC rating F\n\nGreat Shelford is a highly regarded village, just a short distance from Cambridge city centre and the largest centre of medical research and health science in Europe, Cambridge Biomedical Campus. It is also convenient for Babraham Institute, Genome Campus at Hinxton, Granta Park and Chesterford Park. There are a wide range of local amenities including local butchers, bakers, Shelford delicatessen, chemist, public houses, coffee shops and a restaurant in the village.\n\n32 Coppice Avenue sits well back behind a generous driveway and garden to the front, and a large mature garden to the rear. The property offers well-proportioned accommodation throughout, and large picture windows and glazed doors provide an abundance of natural light to all principal rooms.\n\nThe sitting room is a particularly generous space, and two large picture windows provide beautiful views over the mature rear gardens. There are two further reception spaces across the rear of the property; a study which also overlooks the rear garden, and a large dual aspect dining room which opens into the garden and links with the kitchen. The kitchen has been recently re-fitted with contemporary light grey cabinetry and includes a range of integrated Bosch appliances.\n\nThere are two double bedrooms to the front of the property. Both bedrooms are of generous proportions, and each is fitted with a range of built-in wardrobes. The smaller of the two bedrooms also benefits from a dual aspect and fitted hand wash basin and vanity unit.\n\nThere is also a guest cloakroom and a large family bathroom which includes both a separate shower and bath, utility room with side access door and a range of built-in cupboards which provide plentiful storage space.\n\nOutside, the front driveway is bordered with mature hedging, trees and beautifully planted beds and provides ample off-street parking. The rear gardens are well stocked with mature shrubs and trees and provide a secluded outdoor space which is subtly partitioned into three sections including the terrace and pool, the central lawn, and a kitchen garden to the rear. Beyond the garden is a large expanse of greenbelt farmland and a wooded area beyond.\n\nAdditional Information:\n\nTenure: Freehold\n\nLocal Authority: South Cambridgeshire District Council\n\nCouncil Tax: Band G\n\nMains: Gas, water & drainage\n\nViewing: Strictly by appointment through the selling agent Carter Jonas\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_44",
        "UUID": "57486a99-dbea-4272-a854-613ce1950d5d",
        "Image": "https://media.rightmove.co.uk/37k/36227/121117481/36227_CAS220042_IMG_00_0000.jpeg",
        "Price": "£1,525,000",
        "Address": "High Street, Babraham, Cambridge, CB22",
        "Type": "Detached",
        "Description": "Property description\nGrade II listed village house with annexe and extensive useful outbuildings.\n\nDescription\n\nChalk Farmhouse is a substantial former farmhouse situated in the centre of this popular well connected village just south of Cambridge. Grade II listed, the property is believed to date from the 16th Century with later additions and alterations and it includes extensive outbuildings. Of timber framed construction with lime rendered painted elevations under a plain tiled roof, the house has undergone some renovation works during the current owner’s tenure (of around 10 years) including replacement of the render to two elevations with new chestnut lathes and the insertion of sheep’s wool insulation.\n\nThe house has well proportioned accommodation arranged over two floors which extends to around 4557 sq ft and would benefit from a degree of modernisation but it retains that special period farmhouse feel with lots of character and space. On the ground floor there are three large reception rooms, a study, a farmhouse kitchen, large utility/boot room and a small garden room. Beneath part of the ground floor are reasonably large cellars which may have further potential (subject to appropriate permissions and Listed Building consent). At first floor level - accessed via two staircases - there are 7 bedrooms and two bath or shower rooms (one refitted in recent times).\n\nIn addition to the house there is a separate converted former granary which is currently let but has provided useful income from letting on Holiday Lettings (Trip Advisor). This is a first floor conversion with an open plan kitchen/living room/bedroom and a shower room.\n\nThe accommodation is shown in greater detail in the attached floor plans.\n\nOutside\n\nThe property is approached from the street via the entrance to The George public house and a shared drive (shown shaded blue on the siteplan) passing adjacent to a weatherboarded barn leads into a large shingled courtyard.\n\nThe Granary is to the left, accessed via a short flight of stairs, and straight ahead is a long single storey range of brick slated outbuildings divided into 7 stores which may offer potential for conversion (subject to any necessary consents). Please note these were reroofed in 2012. On the other side of the courtyard is a horse-shoe shaped range of brick and flint buildings currently converted to office use and let as two units. These spaces could be used by the owner of Chalk Farmhouse or alternatively, continue to be let out as a potential source of income. The layouts of the buildings are also shown in the attached floor plans.\n\nTo either side of the farmhouse are areas of garden, laid to lawn with mature trees and sheltered from the road by extensive planting.\n\nIn all 0.58 of an acre\n\nLocation\n\nBabraham is a sought-after small, pretty village 4.1 miles south east of the Cambridge city boundary. The village is conveniently situated for nearby business and science parks including the Addenbrookes Biomedical campus, Babraham Institute, Granta Park, The Genome Campus and Little Chesterford research park. There are good local facilities in the village including a public house, The George and a well regarded Primary School.\n\nMainline rail services into Cambridge & London’s Liverpool Street are available from nearby Whittlesford Station.\n\nLocal shopping is available in nearby Sawston. Cambridge offers comprehensive shopping schooling recreational and cultural facilities along with its world renowned University Colleges.\n\nThe A11, which leads south to the M11 (J9a) is just outside the village and via the A505 to Junction 10 which leads north to the A14 and then onward to the A1 M1 & M6 to the north and north west.\n\nStansted Airport is approximately 22 miles south via the M11 (J8).\n\nLondon is approximately 56 miles to the south.\n\nSquare Footage: 4,557 sq ft\n\n\nAcreage: 0.58 Acres\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_45",
        "UUID": "df77187e-54ad-4be3-bc8b-7005a665cae8",
        "Image": "https://media.rightmove.co.uk/48k/47865/126831158/47865_NCA210100_IMG_00_0001.jpeg",
        "Price": "£1,500,000",
        "Address": "The Mazles, Comberton, Cambridge, Cambridgeshire",
        "Type": "Detached",
        "Description": "Property description\n** OPEN TO VIEW EACH WEEKEND BETWEEN 10am AND 5pm **\n\nThe Hemlock (Plot 47/20 The Mazles) is a stunning 5 bedroom detached family home, situated in the corner of this popular development.\n\nThis beautiful home is well laid out and provides a generous 3,112 sq ft of accommodation set out over two floors:\n\nGround Floor\nKitchen: 22'3 x 17'2\nLiving room: 22'3 x 24'3\nDining Room: 19' x 12'8\nWC: 5'9 x 6'9\nUtility Room: 11 x 6'2\nPantry: 10'8 x 6'2\n\nFirst Floor\nMain Bedroom: 18'4 x 14'9\nMain En suite: 11'1 x 8'8\nMain Dressing Room: 12'5 x 7'9\nBedroom 2: 12'1 x 13'6\nBedroom 2 En Suite: 12'1 x 4'6\nBedroom 3: 9'8 x 20'3\nBedroom 4: 9'8 x 19'3\nBedroom 5 : 12'1 x 10'8\nBathroom: 7'3 x 8'5\n\nThe specification has been carefully selected for this home and benefits from the PREMIUM PLUS suite of fittings:\n\nThe kitchen units are a matt finish with handless and soft close doors and drawers, finished with a Silestone worktop and upstands, and a 'Waterfall' finish to the central island. There are three pendant lights fitted over the island unit.\n\nThe appliances include Miele integrated steam oven, down drafter induction hob, integrated single oven x 2, integrated combi microwave, dishwasher and wine chiller. Alongside these is a freestanding Fisher Paykel fridge/freezer.\n\nThe utility room is finished with matching worktop and units.\n\nThe living room is a superb space - with bi-fold doors to the rear garden and a wood burner fitted.\n\nThe bathrooms and en suites are all fitted with an elegant and stylish white Duravit sanitary range with HansGrohe taps and showers.\n\nThere is an air source heat pump which serves the underfloor heating to the ground floor and radiators to the first, along with the hot water.\n\nAll flooring is included - a mix of Karndean, carpet and large format Porcelanosa floor tiles to wet areas.\n\nEach property benefits from landscaping to the front gardens, ensuring that The Birdlings has a welcoming feel to all who live there.\n\nThe garden has an extensive patio and is laid to turf and has a fence boundary.\n\nThe Birdlings benefits from a 10 year LABC Warranty, and this home is ready to move into.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_46",
        "UUID": "d9673944-2c02-486f-82c4-393f2e0c66e4",
        "Image": "https://media.rightmove.co.uk/35k/34529/124426160/34529_CAM200478_IMG_00_0000.jpeg",
        "Price": "£1,500,000",
        "Address": "Marfleet Close, Great Shelford, Cambridge, Cambridgeshire",
        "Type": "Detached",
        "Description": "Property description\nAn exceptional and versatile, 6 bedroom, detached family house with superb views over undulating countryside, in this highly sought-after south Cambridgeshire village.\n\nCambridge city centre 3 miles, M11 (Junction 11) 2.5 miles, Great Shelford Station 1 mile, (distances are approximate).\n\nHill View was individually designed and constructed in 1990 with the added benefit of a Swimming Pool with Plant Room and Shower/Cloakroom. The present owners have undertaken further improvements to the house to include the conversion of the garage into a kitchenette/sitting room and a south facing conservatory. The result is an outstanding family home with beautifully presented accommodation extending to an impressive 4,877 sq ft (453 sq m).\n\n\n\nGreat Shelford is one of the most popular of the necklace villages around Cambridge, benefiting from a good range of local facilities including a variety of shops, primary school, library, church, health centre and recreation ground with tennis courts. The property is well placed for access to Addenbrookes Hospital, the Park and Ride and Gog Magog Golf Club. It is also conveniently placed for commuters by road or rail with the M11 (junction 11) about 3.5 miles away and the A11 about 5 miles and there is a mainline railway station in the village with services to London's Liverpool Street. The University city of Cambridge provides a considerable range of shopping and cultural facilities along with an excellent choice of schools for all age ranges and is easily accessible via a dedicated cycle path leading directly to Addenbrooke’s Hospital/Biomedical Campus and the city beyond.\nBrochures\nParticulars\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_47",
        "UUID": "1e2cddcb-d6b4-4871-89a5-cff90a871038",
        "Image": "https://media.rightmove.co.uk/37k/36227/125522063/36227_CAS220217_IMG_00_0000.jpeg",
        "Price": "£1,500,000",
        "Address": "Back Lane, Barrington, Cambridge, CB22",
        "Type": "Land",
        "Description": "Property description\nUnique opportunity with full planning permission in a much sought after village.\n\nDescription\n\n7 Back Lane is a rare opportunity to buy a wonderful plot measuring approximately 1.51 acres with full planning permission close to the heart of this much sought after village.\n\nThe drawings and further background documentation can be found on the South Cambridgeshire planning portal reference 21/05285/FUL.\n\nThe planning which was obtained by well regarded architect David Snell Ltd has been granted for a incredible single storey four bedroom property extending approximately 4,478 sq ft.\n\nThe property once constructed will comprise a large kitchen breakfast room, principal bedroom suite with en suite bathroom and dressing room, a second bedroom with lounge, en suite and dressing room. There are two further en suite bedrooms, two reception rooms and a study.\n\nThere is also a garage measuring approximately 538 sq ft attached to the house and a green roof studio room which measures approximately 517 sq ft.\n\nThe grounds around the house are somewhat over grown but do include some incredible specimen trees.\n\nLocation\n\nBack Lane is situated in the heart of this picturesque village and close to the village green.\n\nBarrington benefits from a large and very pretty gently sloping village green with football and cricket pitches, a post office and popular pub/restaurant The Royal Oak which overlooks the green.\n\nThere is a well-regarded state primary school within the village and secondary schooling is available in Melbourn along with independent schools for all age groups in Cambridge.\n\nBarrington is approximately seven miles south-west of the historic City of Cambridge which in turn has an excellent range of shopping facilities and wide range of recreational and cultural amenities.\n\nRail services are available from Shepreth (approx. one mile) and Royston (approx. seven and a half miles distant) into Cambridge and London with journey times of 14 and 40 minutes respectively.\n\nThe M11 Duxford Interchange is seven and a half miles with access to London and the North via the A14 and A1 and the east coast ports via the A14.\n\nAll distances and times are approximate.\n\n\n\n\nAcreage: 1.51 Acres\n\nAdditional Info\n\nCouncil tax band - not yet available.\nBrochures\nWeb Details\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    },
    {
        "ID": "property_48",
        "UUID": "3886fd39-c60c-478d-848b-4a150f6a4036",
        "Image": "https://media.rightmove.co.uk/92k/91220/127314731/91220_RS0183_IMG_06_0000.jpeg",
        "Price": "£1,500,000",
        "Address": "Old Rectory Drive, Dry Drayton, Cambridge",
        "Type": "Detached",
        "Description": "Property description\nAn extraordinary development opportunity to bring a 30 room rectory back to life.\n\nThe Old Rectory is a family owned, grade two listed Georgian rectory lying to the West of Cambridge within the picturesque village of Dry Drayton. The building is still owned by the family it once housed through the 60's' 70's and 80's, but after falling into neglect from the mid 90's, it now would suit a purchase for someone with a passion for renovation or property development.\n\nAt circa 12,000 sq ft its an incredibly imposing building. There are four floors, all of which are accessed by a wonderfully preserved and elegant open stair well. Each floor is beautifully proportioned with many of its period features still in tact whilst the rest have been safely stored ready to be re-installed after reviving.\n\nThe Old Rectory is an architectural gem which, in the right hands, would make an extraordinary family home, but It's worth noting that the family would welcome interest from more commercially based developers who might consider converting this building in to luxury apartments and willing to work out a agreement subject to planning permission.\n\nThis property is being handled by Simon Stone. To discuss in more detail or to receive additional information, please send your enquiry to\n\n\nCouncil Tax Band: H\nTenure: Freehold\nCouncil Tax: £3030 per annum\nBrochures\nBrochure\nShow less",
        "Date scraped": "2022-11-02",
        "Time scraped": "11:21"
    }
]